angular.module('starter.services', [])
    .factory('Cities', function () {
        var cities = [{
            id: 524901,
            name: 'Москва',
            emblem: 'img/city/msc.png'
        }, {
            id: 2643741,
            name: 'Лондон',
            emblem: 'img/city/lon.png'
        }, {
            id: 1850147,
            name: 'Токио',
            emblem: 'img/city/tky.png'
        }, {
            id: 5128581,
            name: 'Нью-Йорк',
            emblem: 'img/city/ny.png'
        }, {
            id: 2147714,
            name: 'Сидней',
            emblem: 'img/city/cyd.png'
        }, {
            id: 542420,
            name: 'Краснодар',
            emblem: 'img/city/krd.png'
        }, {
            id: 518255,
            name: 'Новороссийск',
            emblem: 'img/city/nrs.png'
        }, {
            id: 466885,
            name: 'Ейск',
            emblem: 'img/city/eis.png'
        }];
        return {
            all: function () {
                return cities;
            },
            get: function (id) {
                for (var i = 0; i < cities.length; i++) {
                    if (cities[i].id === parseInt(id)) {
                        return cities[i];
                    }
                }
                return null;
            }
        };
    })
    .factory('all_cities', function(){
        var city_list = [
            {
                id: 524901,
                name: 'Москва'
            }, {
                "name": "Развилка",
                "id": 819827
            }, {
                "name": "Решетниково",
                "id": 502069
            }, {
                "name": "Марфино",
                "id": 529368
            }, {
                "name": "Жуковский",
                "id": 462755
            }, {
                "name": "Реутов",
                "id": 502018
            }, {
                "name": "Куровское",
                "id": 538601
            }, {
                "name": "Железнодорожный",
                "id": 463355
            }, {"name": "Голицыно", "id": 560756}, {"name": "Петрозаводск", "id": 509820}, {
                "name": "Санкт Петербург",
                "id": 498817
            }, {"name": "Климовск", "id": 547560}, {"name": "Новосибирск", "id": 1496747}, {
                "name": "Истра",
                "id": 555746
            }, {"name": "Чехов", "id": 569591}, {"name": "Любучаны", "id": 532477}, {
                "name": "Востряково",
                "id": 471457
            }, {"name": "Дубна", "id": 564719}, {"name": "Дружба", "id": 564912}, {
                "name": "Бронницы",
                "id": 571557
            }, {"name": "Дзержинский", "id": 563705}, {"name": "Лыткарино", "id": 532657}, {
                "name": "Мытищи",
                "id": 523812
            }, {"name": "Пушкино", "id": 503977}, {"name": "Правдинский", "id": 505597}, {
                "name": "Зеленоградский",
                "id": 463826
            }, {"name": "Ашукино", "id": 580597}, {"name": "Кхотково", "id": 549373}, {
                "name": "Семхоз",
                "id": 497165
            }, {"name": "Сергиев Посад", "id": 496638}, {"name": "Арсаки", "id": 580881}, {
                "name": "Струнино",
                "id": 487095
            }, {"name": "Александров", "id": 583350}, {"name": "Карабаново", "id": 552977}, {
                "name": "Киржач",
                "id": 548278
            }, {"name": "Орехово-Зуыево", "id": 515024}, {"name": "Ликино-Дулево", "id": 535243}, {
                "name": "Давыдово",
                "id": 566950
            }, {"name": "Илинский Погост", "id": 557132}, {"name": "Фосфоритный", "id": 562445}, {
                "name": "Кхорлово",
                "id": 549531
            }, {"name": "Лопатинский", "id": 534174}, {"name": "Малино", "id": 531098}, {
                "name": "Михнево",
                "id": 526652
            }, {"name": "Столбовая", "id": 487441}, {"name": "Кубинка", "id": 540030}, {
                "name": "Поварово",
                "id": 505824
            }, {"name": "Икша", "id": 557382}, {"name": "Дмитров", "id": 565955}, {
                "name": "Скоропусковскй",
                "id": 492333
            }, {"name": "Мамонтовка", "id": 529638}, {"name": "Борово", "id": 572090}, {
                "name": "Восточный",
                "id": 471501
            }, {"name": "Внуково", "id": 473021}, {"name": "Обнинск", "id": 516436}, {
                "name": "Мстихино",
                "id": 524649
            }, {"name": "Бабынино", "id": 579838}, {"name": "Навля", "id": 523186}, {
                "name": "Алтукхово",
                "id": 582358
            }, {"name": "Кокоревка", "id": 546633}, {"name": "Суземка", "id": 485817}, {
                "name": "Химки",
                "id": 550280
            }, {"name": "Красногорск", "id": 542374}, {"name": "Немчиновка", "id": 522730}, {
                "name": "Ватутинки",
                "id": 476372
            }, {"name": "Ясногорск", "id": 468671}, {"name": "Засечноые", "id": 464343}, {
                "name": "Русский Камешкир",
                "id": 500400
            }, {"name": "Алексеевка", "id": 582926}, {"name": "Набережные Челны", "id": 523750}, {
                "name": "Бугулма",
                "id": 571170
            }, {"name": "Карабаш", "id": 552974}, {"name": "Уссуриыск", "id": 2014006}, {
                "name": "Барвикха",
                "id": 578953
            }, {"name": "Петрово-Далнеые", "id": 509998}, {"name": "Николина Гора", "id": 521821}, {
                "name": "Звенигород",
                "id": 461920
            }, {"name": "Тучково", "id": 480685}, {"name": "Кратово", "id": 541286}, {
                "name": "Конобеыево",
                "id": 545405
            }, {"name": "Воскресенск", "id": 471656}, {"name": "Речицы", "id": 502345}, {
                "name": "Монино",
                "id": 525396
            }, {"name": "Обукхово", "id": 516305}, {"name": "Имени Воровского", "id": 556463}, {
                "name": "Електростал",
                "id": 563523
            }, {"name": "Павловский Посад", "id": 512023}, {"name": "Дрезна", "id": 565007}, {
                "name": "Опалиха",
                "id": 515186
            }, {"name": "Новопетровское", "id": 518346}, {"name": "Вербилки", "id": 475845}, {
                "name": "Ашитково",
                "id": 580616
            }, {"name": "Шатурторф", "id": 495515}, {"name": "Большие Вязьмы", "id": 573922}, {
                "name": "Жаворонки",
                "id": 463465
            }, {"name": "Медвежьегорск", "id": 527888}, {"name": "Оболенск", "id": 6730265}, {
                "name": "Серпухов",
                "id": 496527
            }, {"name": "Пяозерский", "id": 503581}, {"name": "Лоухи", "id": 533964}, {
                "name": "Конаково",
                "id": 545673
            }, {"name": "Новозавидовский", "id": 461704}, {"name": "Козлово", "id": 543106}, {
                "name": "Донской",
                "id": 565284
            }, {"name": "Плотниково", "id": 1506394}, {"name": "Новоподрезково", "id": 518337}, {
                "name": "Сходня",
                "id": 492448
            }, {"name": "Зеленоград", "id": 463829}, {"name": "Алабушево", "id": 583491}, {
                "name": "Петродворец",
                "id": 510225
            }, {"name": "Стрелна", "id": 487227}, {"name": "Уляновск", "id": 479123}, {
                "name": "Мосрентген",
                "id": 6417535
            }, {"name": "Рублево", "id": 500843}, {"name": "Ям", "id": 469341}, {
                "name": "Ступино",
                "id": 486968
            }, {"name": "Мураново", "id": 524423}, {"name": "Солнечногорск", "id": 490996}, {
                "name": "Покров",
                "id": 507599
            }, {"name": "Шчелково", "id": 495344}, {"name": "Фрязино", "id": 562319}, {
                "name": "Софрино",
                "id": 491351
            }, {"name": "Домодедово", "id": 565381}, {"name": "Яковлевскоые", "id": 469533}, {
                "name": "Черноголовка",
                "id": 568808
            }, {"name": "Фряново", "id": 562322}, {"name": "Накхабино", "id": 523553}, {
                "name": "Шаря",
                "id": 495619
            }, {"name": "Мантурово", "id": 529505}, {"name": "Макарыев", "id": 532138}, {
                "name": "Ковернино",
                "id": 543494
            }, {"name": "Городец", "id": 559678}, {"name": "Заволжые", "id": 464101}, {
                "name": "Пестяки",
                "id": 510323
            }, {"name": "Гороховец", "id": 559459}, {"name": "Муром", "id": 524294}, {
                "name": "Касимов",
                "id": 551891
            }, {"name": "Ижевское", "id": 554836}, {"name": "Спасск-Рязанский", "id": 489741}, {
                "name": "Мурмино",
                "id": 524298
            }, {"name": "Рязань", "id": 500096}, {"name": "Ожерелые", "id": 513362}, {
                "name": "Фрязево",
                "id": 562321
            }, {"name": "Звенигово", "id": 461916}, {"name": "Козмодемянск", "id": 543018}, {
                "name": "Бор",
                "id": 572665
            }, {"name": "Нижниы Новгород", "id": 520555}, {"name": "Неклюдово", "id": 522871}, {
                "name": "Палекх",
                "id": 513095
            }, {"name": "Южа", "id": 466084}, {"name": "Камешково", "id": 553389}, {
                "name": "Кидекша",
                "id": 548781
            }, {"name": "Суздаль", "id": 485824}, {"name": "Гаврилов Посад", "id": 561783}, {
                "name": "Юрыев-Полскиы",
                "id": 466215
            }, {"name": "Бавлены", "id": 578641}, {"name": "Колчугино", "id": 546521}, {
                "name": "Смоленск",
                "id": 491687
            }, {"name": "Коммунар", "id": 545791}, {"name": "Боголюбово", "id": 575609}, {
                "name": "Кострома",
                "id": 543878
            }, {"name": "Сусанино", "id": 486015}, {"name": "Иваново", "id": 555312}, {
                "name": "Фурманов",
                "id": 562309
            }, {"name": "Приволжск", "id": 505060}, {"name": "Плес", "id": 509029}, {
                "name": "Котлас",
                "id": 543704
            }, {"name": "Приводино", "id": 505112}, {"name": "Красавино", "id": 542908}, {
                "name": "Великий Устюг",
                "id": 476062
            }, {"name": "Тотма", "id": 481960}, {"name": "Солигалич", "id": 491025}, {
                "name": "Чукхлома",
                "id": 567695
            }, {"name": "Галич", "id": 562161}, {"name": "Електроугли", "id": 563522}, {
                "name": "Старая",
                "id": 489264
            }, {"name": "Сочи", "id": 491422}, {"name": "Красная Поляна", "id": 542681}, {
                "name": "Лазаревское",
                "id": 536625
            }, {"name": "Небуг", "id": 523048}, {"name": "Каменномостский", "id": 553514}, {
                "name": "Дивноморское",
                "id": 566157
            }, {"name": "Геленджик", "id": 561667}, {"name": "Горячий Ключ", "id": 559317}, {
                "name": "Абрау-Дюрсо",
                "id": 584365
            }, {"name": "Анапская", "id": 582181}, {"name": "Витязево", "id": 473295}, {
                "name": "Виноградныы",
                "id": 473546
            }, {"name": "Темрюк", "id": 483661}, {"name": "Голубитская", "id": 560513}, {
                "name": "Акхтанизовская",
                "id": 583811
            }, {"name": "Старонижестеблиыевская", "id": 488713}, {
                "name": "Павловская Слобода",
                "id": 512039
            }, {"name": "Угловоые", "id": 2014571}, {"name": "Кневичи", "id": 2021956}, {
                "name": "Адлер",
                "id": 584243
            }, {"name": "Орел-Изумруд", "id": 803494}, {"name": "Высокоые", "id": 803498}, {
                "name": "Кхоста",
                "id": 549424
            }, {"name": "Дагомыс", "id": 823674}, {"name": "Вардане", "id": 477047}, {
                "name": "Кардоникская",
                "id": 552562
            }, {"name": "Сары-Тюз", "id": 498462}, {"name": "Преградная", "id": 505539}, {
                "name": "Горячеводскиы",
                "id": 559320
            }, {"name": "Шепси", "id": 494846}, {"name": "Пятигорск", "id": 503550}, {
                "name": "Туапсе",
                "id": 480716
            }, {"name": "Минералныые Воды", "id": 526480}, {"name": "Анджиевский", "id": 581788}, {
                "name": "Суворовская",
                "id": 485871
            }, {"name": "Левокумка", "id": 535440}, {"name": "Новомихайловский", "id": 518585}, {
                "name": "Джубга",
                "id": 563601
            }, {"name": "Аркхипо-Осиповка", "id": 580969}, {
                "name": "Солуно-Дмитриевское",
                "id": 490747
            }, {"name": "Хадыженск", "id": 550846}, {"name": "Апшеронск", "id": 581313}, {
                "name": "Пшада",
                "id": 504376
            }, {"name": "Невинномысск", "id": 522377}, {"name": "Кабардинка", "id": 554668}, {
                "name": "Лабинск",
                "id": 537281
            }, {"name": "Саратовская", "id": 498672}, {"name": "Новороссиыск", "id": 518255}, {
                "name": "Белореченск",
                "id": 577893
            }, {"name": "Раыевская", "id": 502542}, {"name": "Северноые", "id": 496385}, {
                "name": "Адыгейск",
                "id": 483142
            }, {"name": "Новоукраинскиы", "id": 517769}, {"name": "Тлюстенкхабл", "id": 482582}, {
                "name": "Пашковский",
                "id": 512382
            }, {"name": "Ставрополь", "id": 487846}, {"name": "Краснодар", "id": 542420}, {
                "name": "Старотитаровская",
                "id": 488606
            }, {"name": "Новотитаровская", "id": 517842}, {"name": "Хатукаы", "id": 550452}, {
                "name": "Славянск-на-Кубани",
                "id": 492094
            }, {"name": "Уст-Лабинск", "id": 478044}, {"name": "Трудобеликовский", "id": 481275}, {
                "name": "Пластуновская",
                "id": 509124
            }, {"name": "Ладожская", "id": 537235}, {"name": "Кропоткин", "id": 540761}, {
                "name": "Медведовская",
                "id": 527968
            }, {"name": "Калининская", "id": 554173}, {"name": "Кавказская", "id": 551669}, {
                "name": "Кореновск",
                "id": 544896
            }, {"name": "Выселки", "id": 470338}, {"name": "Тимашевск", "id": 482965}, {
                "name": "Красногвардеыское",
                "id": 542334
            }, {"name": "Ирклиыевская", "id": 556170}, {"name": "Парковыы", "id": 512533}, {
                "name": "Новорождественская",
                "id": 518249
            }, {"name": "Тихорецк", "id": 483029}, {"name": "Терневская", "id": 483326}, {
                "name": "Новопокровская",
                "id": 518325
            }, {"name": "Кубанский", "id": 540055}, {"name": "Старолеушковская", "id": 488758}, {
                "name": "Белая Глина",
                "id": 578169
            }, {"name": "Павловская", "id": 512051}, {"name": "Песчанокопскоые", "id": 510613}, {
                "name": "Лучегорск",
                "id": 2020689
            }, {"name": "Салск", "id": 499161}, {"name": "Староминская", "id": 488742}, {
                "name": "Кушчевская",
                "id": 538416
            }, {"name": "Канеловская", "id": 553159}, {"name": "Должанская", "id": 565456}, {
                "name": "Пролетарск",
                "id": 504831
            }, {"name": "Ейск", "id": 466885}, {"name": "Орловскиы", "id": 514796}, {
                "name": "Самарскоые",
                "id": 499055
            }, {"name": "Зимовники", "id": 462522}, {"name": "Аксай", "id": 583673}, {
                "name": "Ростов-на-Дону",
                "id": 501175
            }, {"name": "Приморка", "id": 505256}, {"name": "Багаыевская", "id": 579771}, {
                "name": "Дубовскоые",
                "id": 564593
            }, {"name": "Грушевская", "id": 558384}, {"name": "Вяземскиы", "id": 2013229}, {
                "name": "Котелниково",
                "id": 543728
            }, {"name": "Аютинскиы", "id": 580139}, {"name": "Садовоые", "id": 499535}, {
                "name": "Коксовыы",
                "id": 546579
            }, {"name": "Белая Калитва", "id": 578155}, {"name": "Морозовск", "id": 525162}, {
                "name": "Старая Станитса",
                "id": 489062
            }, {"name": "Масаловка", "id": 464130}, {"name": "Глубокий", "id": 561146}, {
                "name": "Капустин Яр",
                "id": 552999
            }, {"name": "Смидович", "id": 2016412}, {"name": "Суровикино", "id": 486071}, {
                "name": "Краснослободск",
                "id": 542213
            }, {"name": "Средняя Ахтуба", "id": 489446}, {"name": "Ленинск", "id": 536156}, {
                "name": "Тарасовский",
                "id": 484396
            }, {"name": "Биробиджан", "id": 2026643}, {"name": "Старыы Оскол", "id": 487928}, {
                "name": "Воронеж",
                "id": 472045
            }, {"name": "Тербуны", "id": 483541}, {"name": "Болокхово", "id": 575343}, {
                "name": "Таруса",
                "id": 484287
            }, {"name": "Кронштадт", "id": 540771}, {"name": "Левашово", "id": 535544}, {
                "name": "Лукховитсы",
                "id": 533543
            }, {"name": "Поляны", "id": 506782}, {"name": "Солотча", "id": 490846}, {
                "name": "Островтсы",
                "id": 514042
            }, {"name": "Томилино", "id": 482260}, {"name": "Люберцы", "id": 532615}, {
                "name": "Оленегорск",
                "id": 515698
            }, {"name": "Ловозеро", "id": 533933}, {"name": "Янтарныы", "id": 2609894}, {
                "name": "Иркутск",
                "id": 2023469
            }, {"name": "Инза", "id": 556283}, {"name": "Вешкама", "id": 473994}, {
                "name": "Мирный",
                "id": 526354
            }, {"name": "Димитровград", "id": 566199}, {"name": "Уфа", "id": 479561}, {
                "name": "Улу-Теляк",
                "id": 479198
            }, {"name": "Уст-Катав", "id": 478071}, {"name": "Петукхово", "id": 1495022}, {
                "name": "Мокроус",
                "id": 525719
            }, {"name": "Пушкино", "id": 504000}, {"name": "Приволжскиы", "id": 505057}, {
                "name": "Микхаылов",
                "id": 527034
            }, {"name": "Саратов", "id": 498677}, {"name": "Валдаы", "id": 477301}, {
                "name": "Новочеркасск",
                "id": 518970
            }, {"name": "Черная", "id": 569077}, {"name": "Киевский", "id": 6697077}, {
                "name": "Ярославл",
                "id": 468902
            }, {"name": "Орел", "id": 515012}, {"name": "Калевала", "id": 554318}, {
                "name": "Електрогорск",
                "id": 563524
            }, {"name": "Залегошч", "id": 465291}, {"name": "Веркховые", "id": 474324}, {
                "name": "Селтсо",
                "id": 497610
            }, {"name": "Брянск", "id": 571476}, {"name": "Заокскиы", "id": 464993}, {
                "name": "Ревякино",
                "id": 501978
            }, {"name": "Горелки", "id": 560154}, {"name": "Тула", "id": 480562}, {
                "name": "Змиыевка",
                "id": 462377
            }, {"name": "Глазуновка", "id": 561313}, {"name": "Золотукхино", "id": 462169}, {
                "name": "Курск",
                "id": 538560
            }, {"name": "Белгород", "id": 578072}, {"name": "Лвовскиы", "id": 533008}, {
                "name": "Гдов",
                "id": 561679
            }, {"name": "Пестравка", "id": 510347}, {"name": "Тулун", "id": 2014927}, {
                "name": "Куытун",
                "id": 2021093
            }, {"name": "Залари", "id": 2012702}, {"name": "Кутулик", "id": 2021116}, {
                "name": "Усолье-Сибирское",
                "id": 2014022
            }, {"name": "Ангарск", "id": 2027667}, {"name": "Шелехов", "id": 2016764}, {
                "name": "Култук",
                "id": 2021343
            }, {"name": "Слюдянка", "id": 2016422}, {"name": "Баыкалск", "id": 2026979}, {
                "name": "Речка-Выдрино",
                "id": 2013225
            }, {"name": "Бабушкин", "id": 2027276}, {"name": "Турунтаево", "id": 2014779}, {
                "name": "Уст-Баргузин",
                "id": 2013986
            }, {"name": "Баргузин", "id": 2027109}, {"name": "Курумкан", "id": 2021188}, {
                "name": "Белоозерскиы",
                "id": 577901
            }, {"name": "Кимры", "id": 548652}, {"name": "Налчик", "id": 523523}, {
                "name": "Сокол",
                "id": 2016334
            }, {"name": "Береза", "id": 577384}, {"name": "Омск", "id": 1496153}, {
                "name": "Юбилеыны",
                "id": 536206
            }, {"name": "Овсянка", "id": 1495797}, {"name": "Нерюнгри", "id": 2019309}, {
                "name": "Парголово",
                "id": 512566
            }, {"name": "Ванавара", "id": 2013727}, {"name": "Лесколово", "id": 535806}, {
                "name": "Нижневартовск",
                "id": 1497543
            }, {"name": "Кханты-Мансиыск", "id": 1503772}, {"name": "Маркха", "id": 2020221}, {
                "name": "Радужныы",
                "id": 1540356
            }, {"name": "Мирныы", "id": 2019951}, {"name": "Укхта", "id": 479411}, {
                "name": "Надым",
                "id": 1498087
            }, {"name": "Новыы Уренгоы", "id": 1496511}, {"name": "Удачныы", "id": 2014624}, {
                "name": "Салекхард",
                "id": 1493197
            }, {"name": "Воркута", "id": 1486910}, {"name": "Чокурдакх", "id": 2126123}, {
                "name": "Тикси",
                "id": 2015306
            }, {"name": "Кхатанга", "id": 2022572}, {"name": "Деденево", "id": 566891}, {
                "name": "Кокошкино",
                "id": 546606
            }, {"name": "Нижняя Мактама", "id": 520318}, {"name": "Каменка", "id": 553778}, {
                "name": "Мурино",
                "id": 524311
            }, {"name": "Шчекино", "id": 495394}, {"name": "Ногинск", "id": 520068}, {
                "name": "Авсюнино",
                "id": 580227
            }, {"name": "Владимир", "id": 473247}, {"name": "Староджерелиыевская", "id": 488839}, {
                "name": "Ленина",
                "id": 536219
            }, {"name": "Знаменск", "id": 831130}, {"name": "Псков", "id": 504341}, {
                "name": "Тюмен",
                "id": 1488754
            }, {"name": "Фирсановка", "id": 562625}, {"name": "Кромы", "id": 540776}, {
                "name": "Йошкар-Ола",
                "id": 466806
            }, {"name": "Маыкоп", "id": 528293}, {"name": "Котелники", "id": 543731}, {
                "name": "Саранск",
                "id": 498698
            }, {"name": "Правда", "id": 2121874}, {"name": "Абакан", "id": 1512236}, {
                "name": "Якутск",
                "id": 2013159
            }, {"name": "Починок", "id": 508606}, {"name": "Подолск", "id": 508101}, {
                "name": "Владивосток",
                "id": 2013348
            }, {"name": "Калининград", "id": 554234}, {"name": "Ростов", "id": 501183}, {
                "name": "Зеленогорск",
                "id": 463830
            }, {"name": "Пенза", "id": 511565}, {"name": "Новоаннинский", "id": 519062}, {
                "name": "Волгоград",
                "id": 472757
            }, {"name": "Татарск", "id": 1490003}, {"name": "Сургут", "id": 1490624}, {
                "name": "Микхаыловск",
                "id": 493702
            }, {"name": "Свободы", "id": 485432}, {"name": "Кудымкар", "id": 539817}, {
                "name": "Грязоветс",
                "id": 558236
            }, {"name": "Вологда", "id": 472459}, {"name": "Бородино", "id": 1508943}, {
                "name": "Красноярск",
                "id": 1502026
            }, {"name": "Хабаровск", "id": 2022890}, {"name": "Барнаул", "id": 1510853}, {
                "name": "Мичуринск",
                "id": 527191
            }, {"name": "Тамбов", "id": 484646}, {"name": "Калуга", "id": 553915}, {
                "name": "Урал",
                "id": 1488458
            }, {"name": "Советская", "id": 490065}, {"name": "Новокузнецк", "id": 1496990}, {
                "name": "Кемерово",
                "id": 1503901
            }, {"name": "Норильск", "id": 1497337}, {"name": "Всеволожск", "id": 471101}, {
                "name": "Коммунар",
                "id": 545788
            }, {"name": "Волгодонск", "id": 472761}, {"name": "Магадан", "id": 2123628}, {
                "name": "Лысва",
                "id": 532675
            }, {"name": "Мурманск", "id": 524305}, {"name": "Череповетс", "id": 569223}, {
                "name": "Усман",
                "id": 478317
            }, {"name": "Липетск", "id": 535121}, {"name": "Тверь", "id": 480060}, {
                "name": "Первоуральск",
                "id": 510808
            }, {"name": "Нововоронеж", "id": 517716}, {"name": "Северск", "id": 1538637}, {
                "name": "Томск",
                "id": 1489425
            }, {"name": "Южно-Сахалинск", "id": 2119441}, {"name": "Чебоксары", "id": 569696}, {
                "name": "Ижевск",
                "id": 554840
            }, {"name": "Енгельс", "id": 563464}, {"name": "Красноармейская", "id": 542461}, {
                "name": "Владикавказ",
                "id": 473249
            }, {"name": "Уст-Илимск", "id": 2013952}, {"name": "Стерлитамак", "id": 487495}, {
                "name": "Пышма",
                "id": 1493870
            }, {"name": "Орск", "id": 514734}, {"name": "Ленинградская", "id": 536200}, {
                "name": "Магнитогорск",
                "id": 532288
            }, {"name": "Черкесск", "id": 569154}, {"name": "Трубчевск", "id": 481350}, {
                "name": "Московскиы",
                "id": 857690
            }, {"name": "Чита", "id": 2025339}, {"name": "Камышин", "id": 553287}, {
                "name": "Миасс",
                "id": 1498894
            }, {"name": "Междуреченск", "id": 1498920}, {"name": "Лобня", "id": 534595}, {
                "name": "Среднеуральск",
                "id": 1491159
            }, {"name": "Алтаыскоые", "id": 1511736}, {"name": "Кыштым", "id": 1500997}, {
                "name": "Воткинск",
                "id": 471430
            }, {"name": "Ачинск", "id": 1512165}, {"name": "Накходка", "id": 2019528}, {
                "name": "Белогорск",
                "id": 2026895
            }, {"name": "Уренгой", "id": 1488414}, {"name": "Выборг", "id": 470546}, {
                "name": "Толмачево",
                "id": 1489474
            }, {"name": "Дагестанскиые Огни", "id": 567290}, {"name": "Махачкала", "id": 532096}, {
                "name": "Таганрог",
                "id": 484907
            }, {"name": "Семикаракорск", "id": 497218}, {"name": "Котовск", "id": 543605}, {
                "name": "Маркс",
                "id": 529073
            }, {"name": "Братск", "id": 2051523}, {"name": "Малышева", "id": 1499668}, {
                "name": "Чапаыевск",
                "id": 569955
            }, {"name": "Минусинск", "id": 1498693}, {"name": "Кызыл", "id": 1500973}, {
                "name": "Железногорск",
                "id": 463343
            }, {"name": "Луга", "id": 533690}, {"name": "Северодвинск", "id": 496285}, {
                "name": "Комсомолск",
                "id": 545736
            }, {"name": "Печора", "id": 511794}, {"name": "Красноярскиы", "id": 542133}, {
                "name": "Троитск",
                "id": 1489246
            }, {"name": "Стар", "id": 489271}, {"name": "Великие Луки", "id": 476077}, {
                "name": "Дзержинск",
                "id": 563708
            }, {"name": "Промышленная", "id": 1494091}, {"name": "Новораычикхинск", "id": 2018882}, {
                "name": "Клин",
                "id": 547523
            }, {"name": "Алметыевск", "id": 582432}, {"name": "Рубтсовск", "id": 1493467}, {
                "name": "Горно-Алтаыск",
                "id": 1506271
            }, {"name": "Сарана", "id": 498703}, {"name": "Киров", "id": 548408}, {
                "name": "Нижнекамск",
                "id": 521118
            }, {"name": "Глазов", "id": 561347}, {"name": "Можайск", "id": 524712}, {
                "name": "Астрахань",
                "id": 580497
            }, {"name": "Красноярская", "id": 795140}, {"name": "Руза", "id": 500303}, {
                "name": "Сторожевая",
                "id": 487372
            }, {"name": "Асбест", "id": 1511330}, {"name": "Артем", "id": 2027456}, {
                "name": "Пушчино",
                "id": 504042
            }, {"name": "Сертолово", "id": 496519}, {"name": "Благовещенск", "id": 2026609}, {
                "name": "Снежинск",
                "id": 1536289
            }, {"name": "Шахты", "id": 496015}, {"name": "Кузнецк", "id": 537737}, {
                "name": "Кисловодск",
                "id": 548114
            }, {"name": "Тырняуз", "id": 479933}, {"name": "Салтыковка", "id": 499133}, {
                "name": "Холмск",
                "id": 2124615
            }, {"name": "Корсаков", "id": 2124286}, {"name": "Тында", "id": 2014718}, {
                "name": "Строитель",
                "id": 487147
            }, {"name": "Игра", "id": 557469}, {"name": "Врангел", "id": 2013258}, {
                "name": "Няган",
                "id": 1496476
            }, {"name": "Черниговка", "id": 2025489}, {"name": "Реж", "id": 1493648}, {
                "name": "Невелск",
                "id": 2122894
            }, {"name": "Лесной", "id": 829005}, {"name": "Стрежевой", "id": 1490796}, {
                "name": "Каргасок",
                "id": 1504382
            }, {"name": "Нижний Тагил", "id": 520494}, {"name": "Болшой Камень", "id": 2026303}, {
                "name": "Романово",
                "id": 1493577
            }, {"name": "Балаково", "id": 579492}, {"name": "Далнереченск", "id": 2025159}, {
                "name": "Жигулевск",
                "id": 463082
            }, {"name": "Сызран", "id": 484972}, {"name": "Балашов", "id": 579460}, {
                "name": "Кантемировка",
                "id": 553099
            }, {"name": "Бузулук", "id": 570427}, {"name": "Протвино", "id": 504576}, {
                "name": "Олга",
                "id": 2018553
            }, {"name": "Инсар", "id": 556318}, {"name": "Тикхвин", "id": 483019}, {
                "name": "Апатиты",
                "id": 581357
            }, {"name": "Челябинск", "id": 1508291}, {"name": "Волга", "id": 472777}, {
                "name": "Лебедян",
                "id": 536518
            }, {"name": "Рассвет", "id": 502738}, {"name": "Колпино", "id": 546105}, {
                "name": "Арзамас",
                "id": 580724
            }, {"name": "Олгинская", "id": 515582}, {"name": "Саров", "id": 498525}, {
                "name": "Жуковка",
                "id": 462822
            }, {"name": "Анива", "id": 2127154}, {"name": "Елиста", "id": 563514}, {
                "name": "Рославл",
                "id": 501283
            }, {"name": "Партизанск", "id": 2018116}, {"name": "Кандалакша", "id": 553190}, {
                "name": "Кинешма",
                "id": 548605
            }, {"name": "Миллерово", "id": 526558}, {"name": "Кумертау", "id": 539283}, {
                "name": "Комсомольск-на-Амуре",
                "id": 2021851
            }, {"name": "Новокубанск", "id": 518682}, {"name": "Борисоглебск", "id": 572525}, {
                "name": "Кирово-Чепетск",
                "id": 548395
            }, {"name": "Теыково", "id": 483137}, {"name": "Отрадныы", "id": 513883}, {
                "name": "Кинел",
                "id": 548625
            }, {"name": "Белоретск", "id": 577881}, {"name": "Саяногорск", "id": 1492893}, {
                "name": "Ыелабуга",
                "id": 468082
            }, {"name": "Мончегорск", "id": 525404}, {"name": "Салават", "id": 499292}, {
                "name": "Кавалерово",
                "id": 2023058
            }, {"name": "Пластун", "id": 2017912}, {"name": "Долинск", "id": 2125945}, {
                "name": "Томари",
                "id": 2120530
            }, {"name": "Россош", "id": 501215}, {"name": "Смирныкх", "id": 2121126}, {
                "name": "Навашино",
                "id": 523198
            }, {"name": "Пучеж", "id": 504294}, {"name": "Павлово", "id": 827329}, {
                "name": "Покровка",
                "id": 2017838
            }, {"name": "Ишимбай", "id": 555980}, {"name": "Гагарин", "id": 562237}, {
                "name": "Мегион",
                "id": 1499053
            }, {"name": "Измаылово", "id": 554791}, {"name": "Канск", "id": 1504682}, {
                "name": "Отрадная",
                "id": 513911
            }, {"name": "Дивногорск", "id": 1507379}, {"name": "Нагорный", "id": 1498067}, {
                "name": "Волск",
                "id": 472278
            }, {"name": "Нефтекамск", "id": 522942}, {"name": "Кодинск", "id": 1503037}, {
                "name": "Сокол",
                "id": 491281
            }, {"name": "Новоуральск", "id": 1538636}, {"name": "Анапа", "id": 582182}, {
                "name": "Котово",
                "id": 543633
            }, {"name": "Беслан", "id": 576697}, {"name": "Киквидзе", "id": 548740}, {
                "name": "Чудово",
                "id": 567774
            }, {"name": "Сосновоборск", "id": 1491291}, {"name": "Шатура", "id": 495518}, {
                "name": "Алдан",
                "id": 2027968
            }, {"name": "Ярославская", "id": 468899}, {"name": "Монетныы", "id": 1498456}, {
                "name": "Белово",
                "id": 1510469
            }, {"name": "Ноябрьск", "id": 1496503}, {"name": "Тобольск", "id": 1489530}, {
                "name": "Карасук",
                "id": 1504489
            }, {"name": "Куанда", "id": 2055815}, {"name": "Георгиевск", "id": 561627}, {
                "name": "Севск",
                "id": 496246
            }, {"name": "Азов", "id": 580054}, {"name": "Одинтсово", "id": 516215}, {
                "name": "Волот",
                "id": 472328
            }, {"name": "Коломна", "id": 546230}, {"name": "Краснокамск", "id": 542327}, {
                "name": "Правдинск",
                "id": 505599
            }, {"name": "Волоколамск", "id": 472433}, {"name": "Лесозаводск", "id": 2020812}, {
                "name": "Курганинск",
                "id": 538836
            }, {"name": "Буденновск", "id": 571306}, {"name": "Советскиы", "id": 1491230}, {
                "name": "Лермонтов",
                "id": 535886
            }, {"name": "Вихоревка", "id": 2013399}, {"name": "Заринск", "id": 1485439}, {
                "name": "Арти",
                "id": 580783
            }, {"name": "Новошахтинск", "id": 517963}, {"name": "Рыбинск", "id": 500004}, {
                "name": "Углич",
                "id": 479532
            }, {"name": "Владимирская", "id": 473166}, {"name": "Балабаново", "id": 579529}, {
                "name": "Богучар",
                "id": 575457
            }, {"name": "Новая Балакхна", "id": 579514}, {"name": "Чистопол", "id": 567990}, {
                "name": "Ипатово",
                "id": 556230
            }, {"name": "Батайск", "id": 578740}, {"name": "Зерноград", "id": 463637}, {
                "name": "Ишим",
                "id": 1505453
            }, {"name": "Уяр", "id": 1487922}, {"name": "Нижнеудинск", "id": 1497549}, {
                "name": "Упорово",
                "id": 1488465
            }, {"name": "Тавда", "id": 1489962}, {"name": "Уват", "id": 1487939}, {
                "name": "Урен",
                "id": 478757
            }, {"name": "Железноводск", "id": 463340}, {"name": "Ванино", "id": 2119932}, {
                "name": "Березники",
                "id": 577206
            }, {"name": "Белый", "id": 577576}, {"name": "Кириллов", "id": 548478}, {
                "name": "Темников",
                "id": 483684
            }, {"name": "Поворино", "id": 505806}, {"name": "Видяево", "id": 473762}, {
                "name": "Чердын",
                "id": 569359
            }, {"name": "Ахтарск", "id": 580420}, {"name": "Новопавловск", "id": 518383}, {
                "name": "Очер",
                "id": 516256
            }, {"name": "Выкса", "id": 470444}, {"name": "Богородск", "id": 575560}, {
                "name": "Гремячинск",
                "id": 558885
            }, {"name": "Заводоуковск", "id": 1485357}, {"name": "Голышманово", "id": 1506422}, {
                "name": "Кашира",
                "id": 551964
            }, {"name": "Никел", "id": 522260}, {"name": "Молочныы", "id": 866057}, {
                "name": "Новая Чара",
                "id": 2055822
            }, {"name": "Бобров", "id": 575948}, {"name": "Кирсанов", "id": 548330}, {
                "name": "Сладково",
                "id": 1491719
            }, {"name": "Аромашево", "id": 1511381}, {"name": "Викулово", "id": 1487112}, {
                "name": "Качканар",
                "id": 554599
            }, {"name": "Соликамск", "id": 491023}, {"name": "Днепровская", "id": 565892}, {
                "name": "Некрасовская",
                "id": 522810
            }, {"name": "Луговая", "id": 533651}, {"name": "Тернеы", "id": 2015352}, {
                "name": "Краснообск",
                "id": 1502091
            }, {"name": "Курсавка", "id": 538582}, {"name": "Серов", "id": 1492663}, {
                "name": "Шахтерск",
                "id": 2121367
            }, {"name": "Арзгир", "id": 580716}, {"name": "Амурск", "id": 2027749}, {
                "name": "Бикин",
                "id": 2026696
            }, {"name": "Чегдомын", "id": 2025579}, {"name": "Окхотск", "id": 2122605}, {
                "name": "Чернушка",
                "id": 568608
            }, {"name": "Александровск", "id": 583041}, {"name": "Краснотуринск", "id": 1502061}, {
                "name": "Талитса",
                "id": 1490281
            }, {"name": "Ревда", "id": 502011}, {"name": "Краснознаменск", "id": 541947}, {
                "name": "Богданович",
                "id": 1509888
            }, {"name": "Мошково", "id": 1498389}, {"name": "Черепаново", "id": 1508161}, {
                "name": "Сузун",
                "id": 1490551
            }, {"name": "Коченево", "id": 1503082}, {"name": "Акхтубинск", "id": 583798}, {
                "name": "Сатка",
                "id": 498418
            }, {"name": "Абаза", "id": 1512205}, {"name": "Аша", "id": 580660}, {
                "name": "Солдатская",
                "id": 491079
            }, {"name": "Гусев", "id": 557882}, {"name": "Сковородино", "id": 2016443}, {
                "name": "Коммунистическиы",
                "id": 1502750
            }, {"name": "Волжск", "id": 472234}, {"name": "Кизляр", "id": 547840}, {
                "name": "Наро-Фоминск",
                "id": 523426
            }, {"name": "Южный", "id": 1485627}, {"name": "Луза", "id": 533143}, {
                "name": "Омутнинск",
                "id": 515267
            }, {"name": "Яранск", "id": 469005}, {"name": "Пурпе", "id": 1539210}, {
                "name": "Барда",
                "id": 579132
            }, {"name": "Кизел", "id": 547875}, {"name": "Горнозаводск", "id": 559752}, {
                "name": "Кунгур",
                "id": 539147
            }, {"name": "Чусовоы", "id": 567434}, {"name": "Нытва", "id": 516576}, {
                "name": "Куыеда",
                "id": 538046
            }, {"name": "Неман", "id": 522742}, {"name": "Нолинск", "id": 520041}, {
                "name": "Кирс",
                "id": 548333
            }, {"name": "Советск", "id": 490068}, {"name": "Мураши", "id": 524414}, {
                "name": "Таыга",
                "id": 1489907
            }, {"name": "Туртас", "id": 1540475}, {"name": "Оричи", "id": 514966}, {
                "name": "Зуыевка",
                "id": 461964
            }, {"name": "Красноармеыск", "id": 542464}, {"name": "Чупа", "id": 567589}, {
                "name": "Борзя",
                "id": 2026126
            }, {"name": "Факел", "id": 563354}, {"name": "Шарыпово", "id": 1492401}, {
                "name": "Бутурлиновка",
                "id": 570563
            }, {"name": "Азовская", "id": 580048}, {"name": "Суворов", "id": 485888}, {
                "name": "Селятино",
                "id": 497534
            }, {"name": "Черноисточинск", "id": 568797}, {"name": "Тазовскиы", "id": 1489853}, {
                "name": "Иртышскиы",
                "id": 1505495
            }, {"name": "Северобаыкалск", "id": 2016910}, {"name": "Красково", "id": 542841}, {
                "name": "Нижнеангарск",
                "id": 2019199
            }, {"name": "Вознесенская", "id": 471188}, {"name": "Сосенскиы", "id": 490437}, {
                "name": "Черкизово",
                "id": 569144
            }, {"name": "Старая Купавна", "id": 489162}, {"name": "Черногорск", "id": 1508054}, {
                "name": "Новыы Сулак",
                "id": 858712
            }, {"name": "Талдом", "id": 484826}, {"name": "Мама", "id": 2020313}, {
                "name": "Горбатов",
                "id": 560285
            }, {"name": "Даровскоы", "id": 567047}, {"name": "Кумены", "id": 539284}, {
                "name": "Санчурск",
                "id": 498877
            }, {"name": "Дудинка", "id": 1507116}, {"name": "Сергач", "id": 496802}, {
                "name": "Шебекино",
                "id": 495112
            }, {"name": "Сосновыы Бор", "id": 490172}, {"name": "Амурзет", "id": 2027740}, {
                "name": "Кавказскиы",
                "id": 551667
            }, {"name": "Высоковск", "id": 470083}, {"name": "Шерегеш", "id": 1492252}, {
                "name": "Кушва",
                "id": 538340
            }, {"name": "Златоуст", "id": 462444}, {"name": "Новоалександровск", "id": 519106}, {
                "name": "Пригородка",
                "id": 505395
            }, {"name": "Кашин", "id": 551986}, {"name": "Светлыы", "id": 485660}, {
                "name": "Полевскоы",
                "id": 1494573
            }, {"name": "Верешчагино", "id": 475777}, {"name": "Анжеро-Судженск", "id": 1511494}, {
                "name": "Вязма",
                "id": 470676
            }, {"name": "Урма", "id": 478704}, {"name": "Борисовка", "id": 572500}, {
                "name": "Углекаменск",
                "id": 2014573
            }, {"name": "Волчанетс", "id": 2013337}, {"name": "Малоярославетс", "id": 530849}, {
                "name": "Лев Толстоы",
                "id": 535417
            }, {"name": "Краснозаводск", "id": 541950}, {"name": "Учалы", "id": 479704}, {
                "name": "Магдагачи",
                "id": 2020591
            }, {"name": "Волжскиы", "id": 472231}, {"name": "Салым", "id": 1493162}, {
                "name": "Актаныш",
                "id": 583578
            }, {"name": "Шимановск", "id": 2016701}, {"name": "Демидов", "id": 566751}, {
                "name": "Красновишерск",
                "id": 542184
            }, {"name": "Таышет", "id": 1489870}, {"name": "Рязанская", "id": 500060}, {
                "name": "Петропавловская",
                "id": 510171
            }, {"name": "Туымазы", "id": 480089}, {"name": "Сибаы", "id": 493160}, {
                "name": "Бирск",
                "id": 576317
            }, {"name": "Белебеы", "id": 578120}, {"name": "Арамил", "id": 1511466}, {
                "name": "Мелеуз",
                "id": 527717
            }, {"name": "Калачинск", "id": 1505074}, {"name": "Павлоградка", "id": 1495480}, {
                "name": "Тара",
                "id": 1490140
            }, {"name": "Нежинка", "id": 522312}, {"name": "Калач-на-Дону", "id": 554397}, {
                "name": "Подстепки",
                "id": 507977
            }, {"name": "Новодвинск", "id": 518909}, {"name": "Ковров", "id": 543460}, {
                "name": "Константиновск",
                "id": 545277
            }, {"name": "Северо-Курильск", "id": 2121385}, {"name": "Тура", "id": 2014833}, {
                "name": "Баыкит",
                "id": 1510689
            }, {"name": "Шаран", "id": 495770}, {"name": "Валуыки", "id": 477192}, {
                "name": "Шарлык",
                "id": 495670
            }, {"name": "Светлоград", "id": 485698}, {"name": "Дегтярск", "id": 1507488}, {
                "name": "Дербент",
                "id": 566532
            }, {"name": "Кондопога", "id": 545626}, {"name": "Зверево", "id": 461910}, {
                "name": "Иловля",
                "id": 556961
            }, {"name": "Вязники", "id": 470666}, {"name": "Янаул", "id": 469178}, {
                "name": "Североморск",
                "id": 496278
            }, {"name": "Кировск", "id": 548391}, {"name": "Детчино", "id": 566363}, {
                "name": "Пычас",
                "id": 503453
            }, {"name": "Черноморскиы", "id": 568785}, {"name": "Пряжа", "id": 504409}, {
                "name": "Унеча",
                "id": 479028
            }, {"name": "Некрасовскиы", "id": 522803}, {"name": "Волгореченск", "id": 472750}, {
                "name": "Суслонгер",
                "id": 485964
            }, {"name": "Пролетарскиы", "id": 504798}, {"name": "Шчербинка", "id": 495260}, {
                "name": "Горбатовка",
                "id": 560281
            }, {"name": "Шексна", "id": 495062}, {"name": "Снегири", "id": 491538}, {
                "name": "Тосно",
                "id": 481964
            }, {"name": "Рефтинскиы", "id": 1493687}, {"name": "Кокхма", "id": 546672}, {
                "name": "Уст-Нера",
                "id": 2120048
            }, {"name": "Пистсово", "id": 509278}, {"name": "Ува", "id": 477656}, {
                "name": "Коммунарка",
                "id": 545782
            }, {"name": "Разумноые", "id": 502400}, {"name": "Тавричанка", "id": 2015455}, {
                "name": "Красноые Село",
                "id": 542000
            }, {"name": "Веркхняя Салда", "id": 1487277}, {"name": "Тсементныы", "id": 1489125}, {
                "name": "Невянск",
                "id": 1497795
            }, {"name": "Богашево", "id": 1509897}, {"name": "Дедовск", "id": 566854}, {
                "name": "Шадринск",
                "id": 1492517
            }, {"name": "Давлеканово", "id": 567006}, {"name": "Чердаклы", "id": 569360}, {
                "name": "Жирновск",
                "id": 462984
            }, {"name": "Сарманово", "id": 498537}, {"name": "Рыбная Слобода", "id": 499987}, {
                "name": "Лаишево",
                "id": 537158
            }, {"name": "Великиы Новгород", "id": 519336}, {
                "name": "Старая Русса",
                "id": 489088
            }, {"name": "Николо-Павловскоые", "id": 1497654}, {"name": "Волчанск", "id": 1486984}, {
                "name": "Костерево",
                "id": 461720
            }, {"name": "Анопино", "id": 581585}, {"name": "Ыессентукская", "id": 466989}, {
                "name": "Некрасовскоые",
                "id": 522799
            }, {"name": "Карабаш", "id": 1504636}, {"name": "Мокшан", "id": 525659}, {
                "name": "Андреыево",
                "id": 581989
            }, {"name": "Пыталово", "id": 503374}, {"name": "Новоржев", "id": 518236}, {
                "name": "Петропавловск-Камчатский",
                "id": 2122104
            }, {"name": "Трудовоые", "id": 2015051}, {"name": "Мегет", "id": 2020095}, {
                "name": "Швартсевскиы",
                "id": 493184
            }, {"name": "Средниы Икоретс", "id": 489495}, {"name": "Давыдовка", "id": 566969}, {
                "name": "Запрудня",
                "id": 464708
            }, {"name": "Шумерля", "id": 493463}, {"name": "Тсивилск", "id": 480851}, {
                "name": "Красноармеыскоые",
                "id": 542429
            }, {"name": "Таытсы", "id": 483898}, {"name": "Кукуштан", "id": 539640}, {
                "name": "Любан",
                "id": 532637
            }, {"name": "Мга", "id": 527220}, {"name": "Богандинскиы", "id": 1509902}, {
                "name": "Лабытнанги",
                "id": 1500933
            }, {"name": "Красныы Октябр", "id": 1501925}, {"name": "Иковка", "id": 1505946}, {
                "name": "Чермоз",
                "id": 569122
            }, {"name": "Северка", "id": 1492637}, {"name": "Полазна", "id": 507318}, {
                "name": "Верхнечусовские Городки",
                "id": 475619
            }, {"name": "Отрадноые", "id": 513898}, {"name": "Сенгилеы", "id": 497094}, {
                "name": "Мариинский Посад",
                "id": 529343
            }, {"name": "Белые Столбы", "id": 577551}, {"name": "Касли", "id": 1504251}, {
                "name": "Новогорный",
                "id": 1497095
            }, {"name": "Гостилитсы", "id": 559242}, {"name": "Бегунитсы", "id": 578326}, {
                "name": "Североуралск",
                "id": 496275
            }, {"name": "Красноуфимск", "id": 542199}, {"name": "Ключевск", "id": 1503169}, {
                "name": "Кипен",
                "id": 504875
            }, {"name": "Малакховка", "id": 531820}, {"name": "Воысковитсы", "id": 471323}, {
                "name": "Северская",
                "id": 496267
            }, {"name": "Яшкино", "id": 1486298}, {"name": "Синявскоые", "id": 492708}, {
                "name": "Новочебоксарск",
                "id": 518976
            }, {"name": "Боровск", "id": 572070}, {"name": "Краснобродский", "id": 1484871}, {
                "name": "Инскоы",
                "id": 1505584
            }, {"name": "Неыво-Рудянка", "id": 1497780}, {"name": "Василыево", "id": 611182}, {
                "name": "Кхряшчевка",
                "id": 549191
            }, {"name": "Ленинскоые", "id": 2020841}, {"name": "Вершино-Дарасунскиы", "id": 2013442}, {
                "name": "Рузаыевка",
                "id": 500299
            }, {"name": "Камышлов", "id": 1504769}, {"name": "Советская Гаван", "id": 2121052}, {
                "name": "Ивдел",
                "id": 1505260
            }, {"name": "Ирбит", "id": 1505526}, {"name": "Кировград", "id": 1503335}, {
                "name": "Росляково",
                "id": 501265
            }, {"name": "Еммаус", "id": 563481}, {"name": "Красныые Ткачи", "id": 541747}, {
                "name": "Зирган",
                "id": 462467
            }, {"name": "Новокорсунская", "id": 518701}, {"name": "Дондуковская", "id": 565357}, {
                "name": "Заинск",
                "id": 465543
            }, {"name": "Джалил", "id": 563681}, {"name": "Петушки", "id": 509697}, {
                "name": "Золотково",
                "id": 462203
            }, {"name": "Ессентуки", "id": 466990}, {"name": "Оргтруд", "id": 514968}, {
                "name": "Высокая Гора",
                "id": 470212
            }, {"name": "Пангоды", "id": 1495626}, {"name": "Боровскиы", "id": 1508879}, {
                "name": "Видноые",
                "id": 473778
            }, {"name": "Рошчино", "id": 501296}, {"name": "Малоые Верево", "id": 530480}, {
                "name": "Кхолмскиы",
                "id": 549741
            }, {"name": "Купино", "id": 1501365}, {"name": "Прокудскоые", "id": 1494111}, {
                "name": "Загорянскиы",
                "id": 465632
            }, {"name": "Богучаны", "id": 1509844}, {"name": "Карпинск", "id": 1504343}, {
                "name": "Лесосибирск",
                "id": 1500607
            }, {"name": "Жуково", "id": 462792}, {"name": "Новая Ляля", "id": 1497276}, {
                "name": "Лобва",
                "id": 1500426
            }, {"name": "Бутка", "id": 1508589}, {"name": "Южноуральск", "id": 1485634}, {
                "name": "Гиагинская",
                "id": 561515
            }, {"name": "Имени Тсюрупы", "id": 556483}, {"name": "Сосногорск", "id": 490391}, {
                "name": "Левиха",
                "id": 535505
            }, {"name": "Павловск", "id": 512053}, {"name": "Каспийск", "id": 551847}, {
                "name": "Печоры",
                "id": 511785
            }, {"name": "Стародубскоые", "id": 488847}, {"name": "Петрокаменскоые", "id": 1495144}, {
                "name": "Петров Вал",
                "id": 509826
            }, {"name": "Ахтырский", "id": 583785}, {"name": "Ленинск-Кузнетский", "id": 1500665}, {
                "name": "Фершампенуаз",
                "id": 562878
            }, {"name": "Родники", "id": 501730}, {"name": "Вурнары", "id": 470845}, {
                "name": "Балтийск",
                "id": 2609906
            }, {"name": "Нестеров", "id": 522508}, {"name": "Уляновка", "id": 479140}, {
                "name": "Нурма",
                "id": 516710
            }, {"name": "Ураы", "id": 1488429}, {"name": "Новые Ляды", "id": 517111}, {
                "name": "Кедровый",
                "id": 1538641
            }, {"name": "Сестроретск", "id": 496478}, {"name": "Лисиы Нос", "id": 534841}, {
                "name": "Вычегодский",
                "id": 470530
            }, {"name": "Билибино", "id": 2126682}, {"name": "Новогуровский", "id": 518845}, {
                "name": "Игрим",
                "id": 1505965
            }, {"name": "Новотроицк", "id": 517836}, {"name": "Кировская", "id": 548390}, {
                "name": "Казанская",
                "id": 551439
            }, {"name": "Оловянная", "id": 2018498}, {"name": "Армавир", "id": 580922}, {
                "name": "Троитск",
                "id": 481608
            }, {"name": "Удомля", "id": 452949}, {"name": "Володарск", "id": 472494}, {
                "name": "Краснокаменск",
                "id": 2021618
            }, {"name": "Афипский", "id": 584126}, {"name": "Энем", "id": 563472}, {
                "name": "Клинтсы",
                "id": 547475
            }, {"name": "Илский", "id": 556951}, {"name": "Ивангород", "id": 555624}, {
                "name": "Прокопыевск",
                "id": 1494114
            }, {"name": "Гарболово", "id": 561999}, {"name": "Синявино", "id": 492712}, {
                "name": "Дорогино",
                "id": 1507239
            }, {"name": "Коряжма", "id": 544370}, {"name": "Заречныы", "id": 1485445}, {
                "name": "Веркхняя Пышма",
                "id": 1487281
            }, {"name": "Медногорск", "id": 528109}, {"name": "Колпашево", "id": 1502862}, {
                "name": "Колюбакино",
                "id": 545978
            }, {"name": "Болшоые Село", "id": 573338}, {"name": "Бодаыбо", "id": 2026583}, {
                "name": "Сосьва",
                "id": 1491267
            }, {"name": "Ачит", "id": 584308}, {"name": "Туринск", "id": 1488933}, {
                "name": "Бисерт",
                "id": 576260
            }, {"name": "Ковдор", "id": 543508}, {"name": "Поволжский", "id": 867006}, {
                "name": "Александровскоые",
                "id": 582993
            }, {"name": "Такхтамукаы", "id": 515921}, {"name": "Сосновка", "id": 490276}, {
                "name": "Коркино",
                "id": 1502536
            }, {"name": "Аргаяш", "id": 1511428}, {"name": "Алексеевское", "id": 582775}, {
                "name": "Кунашак",
                "id": 1501402
            }, {"name": "Березовский", "id": 1510203}, {"name": "Локня", "id": 534423}, {
                "name": "Троицкая",
                "id": 481605
            }, {"name": "Дружинино", "id": 564878}, {"name": "Староуткинск", "id": 488593}, {
                "name": "Тугулым",
                "id": 1489057
            }, {"name": "Туринская Слобода", "id": 1488931}, {"name": "Пионерский", "id": 509437}, {
                "name": "Нижняя Салда",
                "id": 1497393
            }, {"name": "Белоярск", "id": 1510454}, {"name": "Десногорск", "id": 566384}, {
                "name": "Карталы",
                "id": 1504317
            }, {"name": "Шакхуня", "id": 496012}, {"name": "Канаш", "id": 553216}, {
                "name": "Арсеныев",
                "id": 2027468
            }, {"name": "Николо-Березовка", "id": 521814}, {"name": "Балезино", "id": 579432}, {
                "name": "Ворсма",
                "id": 471760
            }, {"name": "Алексеевка", "id": 582956}, {"name": "Дятково", "id": 563822}, {
                "name": "Лесной Городок",
                "id": 535695
            }, {"name": "Владимиро-Александровское", "id": 2013362}, {
                "name": "Снежногорск",
                "id": 795243
            }, {"name": "Зеленоградск", "id": 463828}, {"name": "Пироговский", "id": 509392}, {
                "name": "Боград",
                "id": 1509847
            }, {"name": "Боровичи", "id": 572154}, {"name": "Нарян-Мар", "id": 523392}, {
                "name": "Питкяранта",
                "id": 509234
            }, {"name": "Алеыск", "id": 1511783}, {"name": "Чекмагуш", "id": 569579}, {
                "name": "Крымск",
                "id": 540251
            }, {"name": "Палкино", "id": 513051}, {"name": "Буланаш", "id": 1508715}, {
                "name": "Васюринская",
                "id": 476417
            }, {"name": "Дунаы", "id": 2024800}, {"name": "Чебаркул", "id": 1508350}, {
                "name": "Тургояк",
                "id": 1488937
            }, {"name": "Завитинск", "id": 2012626}, {"name": "Далматово", "id": 1507565}, {
                "name": "Илинскоые-Кхованскоые",
                "id": 557060
            }, {"name": "Торжок", "id": 481985}, {"name": "Лесогорск", "id": 1500609}, {
                "name": "Лешуконскоые",
                "id": 535839
            }, {"name": "Курская", "id": 538558}, {"name": "Кулоы", "id": 539385}, {
                "name": "Спасск-Далниы",
                "id": 2016187
            }, {"name": "Окханск", "id": 516073}, {"name": "Слантсы", "id": 492162}, {
                "name": "Зея",
                "id": 2012593
            }, {"name": "Лиман", "id": 535229}, {"name": "Пятигорскиы", "id": 503548}, {
                "name": "Серафимович",
                "id": 496957
            }, {"name": "Фролово", "id": 562389}, {"name": "Кременки", "id": 541235}, {
                "name": "Ядрин",
                "id": 469809
            }, {"name": "Каыыеркан", "id": 1504139}, {"name": "Шакховская", "id": 496035}, {
                "name": "Лосино-Петровскиы",
                "id": 534015
            }, {"name": "Старыые Озинки", "id": 513329}, {"name": "Износки", "id": 554776}, {
                "name": "Абинск",
                "id": 584441
            }, {"name": "Пустошка", "id": 503878}, {"name": "Кикнур", "id": 548747}, {
                "name": "Юрга",
                "id": 1485724
            }, {"name": "Куса", "id": 538442}, {"name": "Тамбовка", "id": 2015608}, {
                "name": "Ливны",
                "id": 534701
            }, {"name": "Приозерск", "id": 505230}, {"name": "Гвардеыск", "id": 557710}, {
                "name": "Мензелинск",
                "id": 527529
            }, {"name": "Персиановка", "id": 802714}, {"name": "Забаыкалск", "id": 2012780}, {
                "name": "Вилючинск",
                "id": 2118647
            }, {"name": "Оршанка", "id": 514739}, {"name": "Мамоново", "id": 2609901}, {
                "name": "Колыван",
                "id": 1502822
            }, {"name": "Осинники", "id": 1495974}, {"name": "Бреды", "id": 1508811}, {
                "name": "Старая Ладога",
                "id": 489158
            }, {"name": "Усть-Абакан", "id": 1488272}, {"name": "Барабинск", "id": 1510916}, {
                "name": "Маыя",
                "id": 2020121
            }, {"name": "Киселевск", "id": 1503277}, {"name": "Кондрово", "id": 545575}, {
                "name": "Дубовка",
                "id": 564654
            }, {"name": "Абдулино", "id": 584471}, {"name": "Кизнер", "id": 547831}, {
                "name": "Ржев",
                "id": 499717
            }, {"name": "Нижниы Уфалеы", "id": 520473}, {"name": "Кармаскалы", "id": 552312}, {
                "name": "Лакинск",
                "id": 537107
            }, {"name": "Алексин", "id": 582750}, {"name": "Ибреси", "id": 557628}, {
                "name": "Агрыз",
                "id": 583983
            }, {"name": "Буинск", "id": 571155}, {"name": "Нагорск", "id": 523583}, {
                "name": "Нижниые Серги",
                "id": 520667
            }, {"name": "Умба", "id": 479071}, {"name": "Товарково", "id": 481941}, {
                "name": "Уваровка",
                "id": 477629
            }, {"name": "Пудож", "id": 504269}, {"name": "Новая Ладога", "id": 519630}, {
                "name": "Скопин",
                "id": 492376
            }, {"name": "Курлово", "id": 538696}, {"name": "Озерск", "id": 1538634}, {
                "name": "Вешенская",
                "id": 473998
            }, {"name": "Бердигестякх", "id": 2026861}, {"name": "Тселина", "id": 481036}, {
                "name": "Рошал",
                "id": 501320
            }, {"name": "Бирюсинск", "id": 1510041}, {"name": "Собинка", "id": 491480}, {
                "name": "Таксимо",
                "id": 2015701
            }, {"name": "Динская", "id": 566181}, {"name": "Оса", "id": 514706}, {
                "name": "Арск",
                "id": 580850
            }, {"name": "Раыевскиы", "id": 502540}, {"name": "Ленск", "id": 2020838}, {
                "name": "Королев",
                "id": 554233
            }, {"name": "Корткерос", "id": 544397}, {"name": "Озеры", "id": 513378}, {
                "name": "Выритса",
                "id": 470368
            }, {"name": "Меленки", "id": 527740}, {"name": "Свободныы", "id": 2015833}, {
                "name": "Трекхгорныы",
                "id": 830844
            }, {"name": "Кхарп", "id": 1503726}, {"name": "Семенов", "id": 497450}, {
                "name": "Кировск",
                "id": 548392
            }, {"name": "Красноармеыск", "id": 542463}, {"name": "Топки", "id": 1489394}, {
                "name": "Иланскиы",
                "id": 1505933
            }, {"name": "Чишмы", "id": 568012}, {"name": "Чкаловск", "id": 567902}, {
                "name": "Курумоч",
                "id": 538508
            }, {"name": "Мариинск", "id": 1499350}, {"name": "Вязовая", "id": 470653}, {
                "name": "Агалатово",
                "id": 584059
            }, {"name": "Алагир", "id": 802078}, {"name": "Стародуб", "id": 488852}, {
                "name": "Безенчук",
                "id": 576590
            }, {"name": "Перевоз", "id": 511287}, {"name": "Зеленодолск", "id": 463835}, {
                "name": "Болшоые Мурашкино",
                "id": 573471
            }, {"name": "Мраково", "id": 524681}, {"name": "Игарка", "id": 1505991}, {
                "name": "Кулебаки",
                "id": 539555
            }, {"name": "Мортка", "id": 1498402}, {"name": "Зеленоборск", "id": 1485286}, {
                "name": "Киров",
                "id": 548410
            }, {"name": "Бугры", "id": 824070}, {"name": "Приморск", "id": 505270}, {
                "name": "Избербаш",
                "id": 554894
            }, {"name": "Светлогорск", "id": 485699}, {"name": "Новозыбков", "id": 517269}, {
                "name": "Чернякховск",
                "id": 568595
            }, {"name": "Палласовка", "id": 513042}, {"name": "Зеленогорск", "id": 1488253}, {
                "name": "Белев",
                "id": 578091
            }, {"name": "Аскиз", "id": 1511304}, {"name": "Заозерск", "id": 828218}, {
                "name": "Славск",
                "id": 492112
            }, {"name": "Мамонтово", "id": 1499428}, {"name": "Грязи", "id": 558312}, {
                "name": "Ола",
                "id": 2122574
            }, {"name": "Кондратово", "id": 829032}, {"name": "Асино", "id": 1511309}, {
                "name": "Киренск",
                "id": 2022083
            }, {"name": "Николск", "id": 521776}, {"name": "Ишеыевка", "id": 555984}, {
                "name": "Нелидово",
                "id": 522775
            }, {"name": "Вишневогорск", "id": 1487074}, {"name": "Кугеси", "id": 539794}, {
                "name": "Шилка",
                "id": 2016708
            }, {"name": "Каменск-Шакхтинскиы", "id": 553399}, {"name": "Кукмор", "id": 539689}, {
                "name": "Сорск",
                "id": 1491360
            }, {"name": "Баксан", "id": 579574}, {"name": "Сурск", "id": 486048}, {
                "name": "Назарово",
                "id": 1497951
            }, {"name": "Ржавки", "id": 499727}, {"name": "Оссора", "id": 2122389}, {
                "name": "Тигил",
                "id": 2120612
            }, {"name": "Палана", "id": 2122262}, {"name": "Тиличики", "id": 2120591}, {
                "name": "Ардатов",
                "id": 581186
            }, {"name": "Каменногорск", "id": 553518}, {"name": "Агинскоые", "id": 2028078}, {
                "name": "Етока",
                "id": 563395
            }, {"name": "Адамовка", "id": 584279}, {"name": "Баранчинскиы", "id": 579266}, {
                "name": "Самус",
                "id": 1493110
            }, {"name": "Омсукчан", "id": 2122493}, {"name": "Осташков", "id": 514259}, {
                "name": "Гаврилов-Ям",
                "id": 561762
            }, {"name": "Чаплыгин", "id": 569934}, {"name": "Шатки", "id": 495562}, {
                "name": "Новосоколники",
                "id": 517921
            }, {"name": "Черскиы", "id": 2126199}, {"name": "Болкхов", "id": 575364}, {
                "name": "Кимовск",
                "id": 548658
            }, {"name": "Светогорск", "id": 485639}, {"name": "Мирныы", "id": 526357}, {
                "name": "Мышкин",
                "id": 523859
            }, {"name": "Невел", "id": 522410}, {"name": "Аыкино", "id": 580182}, {
                "name": "Малая Пурга",
                "id": 531426
            }, {"name": "Талнакх", "id": 1490256}, {"name": "Автуры", "id": 580218}, {
                "name": "Гудермес",
                "id": 558118
            }, {"name": "Черлак", "id": 1508138}, {"name": "Ардон", "id": 581179}, {
                "name": "Аликово",
                "id": 582533
            }, {"name": "Суоярви", "id": 486186}, {"name": "Венев", "id": 475881}, {
                "name": "Катав-Ивановск",
                "id": 551794
            }, {"name": "Буздяк", "id": 570455}, {"name": "Задонск", "id": 465726}, {
                "name": "Даурия",
                "id": 2025099
            }, {"name": "Няндома", "id": 516647}, {"name": "Кхорол", "id": 2022289}, {
                "name": "Бердяуш",
                "id": 577450
            }, {"name": "Ыенисеыск", "id": 1485997}, {"name": "Ливадия", "id": 2020734}, {
                "name": "Раычикхинск",
                "id": 2017487
            }, {"name": "Красныы Сулин", "id": 541404}, {"name": "Красная Горбатка", "id": 542776}, {
                "name": "Гулкевичи",
                "id": 558066
            }, {"name": "Кувандык", "id": 538138}, {"name": "Моргауши", "id": 525280}, {
                "name": "Белая Кхолунитса",
                "id": 578152
            }, {"name": "Убинскоые", "id": 1488708}, {"name": "Бакал", "id": 579738}, {
                "name": "Болгар",
                "id": 570990
            }, {"name": "Гусиноозерск", "id": 2023782}, {"name": "Салаир", "id": 1493224}, {
                "name": "Торопетс",
                "id": 482042
            }, {"name": "Жешарт", "id": 463144}, {"name": "Острогожск", "id": 514198}, {
                "name": "Ясныы",
                "id": 468657
            }, {"name": "Сернур", "id": 496561}, {"name": "Рассказово", "id": 502793}, {
                "name": "Бавлы",
                "id": 578638
            }, {"name": "Уруссу", "id": 478565}, {"name": "Надвоитсы", "id": 523662}, {
                "name": "Панковка",
                "id": 512817
            }, {"name": "Обоян", "id": 516400}, {"name": "Зеленокумск", "id": 463824}, {
                "name": "Роговская",
                "id": 501579
            }, {"name": "Старошчербиновская", "id": 488635}, {"name": "Новая Маына", "id": 519611}, {
                "name": "Сасово",
                "id": 461699
            }, {"name": "Ярега", "id": 468991}, {"name": "Волоконовка", "id": 472428}, {
                "name": "Козловка",
                "id": 543133
            }, {"name": "Яыва", "id": 468560}, {"name": "Веркхний", "id": 474821}, {
                "name": "Кушнаренково",
                "id": 538368
            }, {"name": "Вичуга", "id": 473788}, {"name": "Балакирево", "id": 579496}, {
                "name": "Сим",
                "id": 492944
            }, {"name": "Чунскиы", "id": 1507636}, {"name": "Шумикха", "id": 1491999}, {
                "name": "Беркакит",
                "id": 2026777
            }, {"name": "Нюрба", "id": 2018735}, {"name": "Яр-Сале", "id": 1486321}, {
                "name": "Полярныы",
                "id": 506763
            }, {"name": "Мамадыш", "id": 529709}, {"name": "Приобые", "id": 1536757}, {
                "name": "Саянск",
                "id": 2055166
            }, {"name": "Реттикховка", "id": 2017452}, {"name": "Приморско-Акхтарск", "id": 505259}, {
                "name": "Микхаыловка",
                "id": 2020013
            }, {"name": "Монастыришче", "id": 2019819}, {"name": "Калач", "id": 554410}, {
                "name": "Богатыые Сабы",
                "id": 575728
            }, {"name": "Токсово", "id": 482443}, {"name": "Вилюыск", "id": 2013392}, {
                "name": "Кесова Гора",
                "id": 550949
            }, {"name": "Камызяк", "id": 553248}, {"name": "Грозныы", "id": 558418}, {
                "name": "Уст-Уда",
                "id": 2013865
            }, {"name": "Александровск-Сакхалинскиы", "id": 2127282}, {
                "name": "Урмары",
                "id": 478689
            }, {"name": "Толмачево", "id": 482390}, {"name": "Демяново", "id": 566635}, {
                "name": "Артемовскиы",
                "id": 1511368
            }, {"name": "Ужур", "id": 1487882}, {"name": "Шушенскоые", "id": 1491953}, {
                "name": "Куыбышев",
                "id": 1501141
            }, {"name": "Парабел", "id": 1495586}, {"name": "Бокситогорск", "id": 575410}, {
                "name": "Лямбир",
                "id": 532895
            }, {"name": "Решетикха", "id": 502078}, {"name": "Моршанск", "id": 525138}, {
                "name": "Дигора",
                "id": 566243
            }, {"name": "Урюпинск", "id": 478544}, {"name": "Климово", "id": 547591}, {
                "name": "Береславка",
                "id": 577403
            }, {"name": "Кхасавюрт", "id": 550478}, {"name": "Мари-Турек", "id": 529195}, {
                "name": "Карабулак",
                "id": 552951
            }, {"name": "Сангар", "id": 2017215}, {"name": "Рылск", "id": 695019}, {
                "name": "Агаповка",
                "id": 584051
            }, {"name": "Семибратово", "id": 497242}, {"name": "Гурыевск", "id": 1506073}, {
                "name": "Двуреченск",
                "id": 1507059
            }, {"name": "Незлобная", "id": 522301}, {"name": "Карачев", "id": 552920}, {
                "name": "Жердевка",
                "id": 463217
            }, {"name": "Багратионовск", "id": 579760}, {"name": "Нязепетровск", "id": 516615}, {
                "name": "Гизел",
                "id": 561437
            }, {"name": "Кормиловка", "id": 1502526}, {"name": "Тогучин", "id": 1489508}, {
                "name": "Катунино",
                "id": 551736
            }, {"name": "Мечетинская", "id": 528137}, {"name": "Гидроторф", "id": 561504}, {
                "name": "Селты",
                "id": 497547
            }, {"name": "Кабаково", "id": 554692}, {"name": "Воля", "id": 472271}, {
                "name": "Чулман",
                "id": 2025261
            }, {"name": "Таман", "id": 484670}, {"name": "Поярково", "id": 2017705}, {
                "name": "Сусуман",
                "id": 2120864
            }, {"name": "Парфино", "id": 512570}, {"name": "Буынакск", "id": 570479}, {
                "name": "Курагино",
                "id": 1501356
            }, {"name": "Баы-Кхаак", "id": 1510690}, {"name": "Николаыевск-на-Амуре", "id": 2122850}, {
                "name": "Полысаыево",
                "id": 1494456
            }, {"name": "Уст-Кулом", "id": 478050}, {"name": "Горняк", "id": 1506260}, {
                "name": "Юргамыш",
                "id": 1485721
            }, {"name": "Гаджиыево", "id": 562245}, {"name": "Бакчар", "id": 1511057}, {
                "name": "Сукхоы Лог",
                "id": 1490686
            }, {"name": "Нижниы Одес", "id": 520552}, {"name": "Кожевниково", "id": 1502257}, {
                "name": "Нарткала",
                "id": 523405
            }, {"name": "Атиг", "id": 580426}, {"name": "Варгаши", "id": 1487784}, {
                "name": "Нижнеивкино",
                "id": 521123
            }, {"name": "Лосиныы", "id": 1500335}, {"name": "Афонино", "id": 584104}, {
                "name": "Черемкхово",
                "id": 2025527
            }, {"name": "Камен-Рыболов", "id": 2023226}, {"name": "Могоча", "id": 2019912}, {
                "name": "Акша",
                "id": 2028028
            }, {"name": "Краснослободск", "id": 542212}, {"name": "Ногир", "id": 520065}, {
                "name": "Дюртюли",
                "id": 563719
            }, {"name": "Синегорск", "id": 2121198}, {"name": "Соколово", "id": 1491535}, {
                "name": "Чалтырь",
                "id": 570021
            }, {"name": "Гжел", "id": 557657}, {"name": "Кулешовка", "id": 539537}, {
                "name": "Моряковскиы Затон",
                "id": 1498399
            }, {"name": "Платнировская", "id": 509113}, {"name": "Плавск", "id": 509052}, {
                "name": "Серебряный Бор",
                "id": 2016977
            }, {"name": "Олекминск", "id": 2018571}, {"name": "Магнитка", "id": 532292}, {
                "name": "Куртамыш",
                "id": 1501255
            }, {"name": "Новомышастовская", "id": 518540}, {"name": "Култаыево", "id": 539369}, {
                "name": "Спас-Клепики",
                "id": 489862
            }, {"name": "Сива", "id": 492592}, {"name": "Егвекинот", "id": 4031742}, {
                "name": "Яя",
                "id": 1486261
            }, {"name": "Борисоглебскиы", "id": 572520}, {"name": "Джигинка", "id": 563618}, {
                "name": "Дно",
                "id": 565885
            }, {"name": "Советск", "id": 490067}, {"name": "Калининск", "id": 554199}, {
                "name": "Нея",
                "id": 522353
            }, {"name": "Сорочинск", "id": 490554}, {"name": "Фатеж", "id": 563300}, {
                "name": "Анучино",
                "id": 2027596
            }, {"name": "Новая Малыкла", "id": 518619}, {"name": "Белокурикха", "id": 1510502}, {
                "name": "Чегем",
                "id": 569639
            }, {"name": "Стародеревянковская", "id": 488859}, {"name": "Юрыеветс", "id": 466258}, {
                "name": "Кхаровск",
                "id": 550512
            }, {"name": "Вяртсиля", "id": 470762}, {"name": "Железногорск-Илимскиы", "id": 2012557}, {
                "name": "Кувшиново",
                "id": 538104
            }, {"name": "Сясстроы", "id": 485313}, {"name": "Челбасская", "id": 569540}, {
                "name": "Имени Морозова",
                "id": 556575
            }, {"name": "Уварово", "id": 477626}, {"name": "Кош-Агач", "id": 1502422}, {
                "name": "Андреапол",
                "id": 582105
            }, {"name": "Киясово", "id": 547927}, {"name": "Кетово", "id": 1503879}, {
                "name": "Атамановка",
                "id": 2027373
            }, {"name": "Старокорсунская", "id": 488785}, {"name": "Сергокала", "id": 496610}, {
                "name": "Тбилисская",
                "id": 483883
            }, {"name": "Гай", "id": 561731}, {"name": "Благодарныы", "id": 576172}, {
                "name": "Алапаевск",
                "id": 1511954
            }, {"name": "Городишче", "id": 559654}, {
                "name": "Волно-Надеждинскоые",
                "id": 2013332
            }, {"name": "Веркхниы Уфалеы", "id": 1487394}, {"name": "Заречныы", "id": 464625}, {
                "name": "Рудня",
                "id": 500678
            }, {"name": "Ремонтноые", "id": 502185}, {"name": "Калтан", "id": 1504972}, {
                "name": "Лангепас",
                "id": 6696767
            }, {"name": "Красныы Яр", "id": 541337}, {"name": "Кировскиы", "id": 2022064}, {
                "name": "Линево",
                "id": 1500532
            }, {"name": "Когалым", "id": 6695754}, {"name": "Левокумскоые", "id": 535438}, {
                "name": "Летняя Ставка",
                "id": 535605
            }, {"name": "Орда", "id": 515098}, {"name": "Новыы Рогачик", "id": 516875}, {
                "name": "Новыы Ургал",
                "id": 2047258
            }, {"name": "Муравленко", "id": 1540711}, {"name": "Пыт-Якх", "id": 6696686}, {
                "name": "Первомаыск",
                "id": 511002
            }, {"name": "Менделеыевск", "id": 527579}, {"name": "Старая Полтавка", "id": 489102}, {
                "name": "Чара",
                "id": 2025630
            }, {"name": "Степноые", "id": 797411}, {"name": "Татишчево", "id": 484034}, {
                "name": "Увелскиы",
                "id": 1487933
            }, {"name": "Фокино", "id": 2015310}, {"name": "Усинск", "id": 863061}, {
                "name": "Ерофей Павлович",
                "id": 2012938
            }, {"name": "Елан", "id": 468063}, {"name": "Дивноые", "id": 566155}, {
                "name": "Добрянка",
                "id": 565778
            }, {"name": "Железногорск", "id": 1538635}, {"name": "Вятские Поляны", "id": 470734}, {
                "name": "Бологоые",
                "id": 575349
            }, {"name": "Радужный", "id": 7117885}, {
                "name": "Романовская",
                "id": 501405
            }, {"name": "Родионово-Несветаыская", "id": 501774}, {
                "name": "Румянтсево",
                "id": 500589
            }, {"name": "Кагалнитская", "id": 554482}, {"name": "Казанская", "id": 551438}, {
                "name": "Калязин",
                "id": 553884
            }, {"name": "Кашары", "id": 552006}, {"name": "Лысково", "id": 532715}, {
                "name": "Матвеев Курган",
                "id": 528495
            }, {"name": "Прокхоровка", "id": 504915}, {"name": "Мирный", "id": 831129}, {
                "name": "Новониколаыевскиы",
                "id": 518488
            }, {"name": "Новый Оскол", "id": 516931}, {"name": "Тольятти", "id": 482283}, {
                "name": "Терек",
                "id": 483495
            }, {"name": "Крыловская", "id": 540268}];
        return {
            all: function () {
                return city_list;
            },
            get: function (name) {
                var id = "null";
                angular.forEach(city_list, function (city) {
                    if (city.name.toUpperCase() == name.toUpperCase()) id = city.id
                });
                return id;
            }
        };
    })
    .factory('Common_weather', function(){
        var common_weather = [
            {
                "date": "01.01",
                "cloud": 55,
                "temp": 4,
                "precip": 4
            },
            {
                "date": "02.01",
                "cloud": 41,
                "temp": 5,
                "precip": 15
            },
            {
                "date": "03.01",
                "cloud": 47,
                "temp": 4,
                "precip": 8
            },
            {
                "date": "04.01",
                "cloud": 68,
                "temp": 3,
                "precip": 22
            },
            {
                "date": "05.01",
                "cloud": 58,
                "temp": 2,
                "precip": 19
            },
            {
                "date": "06.01",
                "cloud": 58,
                "temp": 1,
                "precip": 19
            },
            {
                "date": "07.01",
                "cloud": 66,
                "temp": 0,
                "precip": 23
            },
            {
                "date": "08.01",
                "cloud": 51,
                "temp": 1,
                "precip": 15
            },
            {
                "date": "09.01",
                "cloud": 55,
                "temp": 1,
                "precip": 12
            },
            {
                "date": "10.01",
                "cloud": 60,
                "temp": 3,
                "precip": 11
            },
            {
                "date": "11.01",
                "cloud": 48,
                "temp": 2,
                "precip": 4
            },
            {
                "date": "12.01",
                "cloud": 60,
                "temp": 4,
                "precip": 8
            },
            {
                "date": "13.01",
                "cloud": 45,
                "temp": 4,
                "precip": 26
            },
            {
                "date": "14.01",
                "cloud": 74,
                "temp": 2,
                "precip": 37
            },
            {
                "date": "15.01",
                "cloud": 54,
                "temp": 3,
                "precip": 7
            },
            {
                "date": "16.01",
                "cloud": 68,
                "temp": 4,
                "precip": 30
            },
            {
                "date": "17.01",
                "cloud": 65,
                "temp": 2,
                "precip": 19
            },
            {
                "date": "18.01",
                "cloud": 62,
                "temp": 3,
                "precip": 30
            },
            {
                "date": "19.01",
                "cloud": 51,
                "temp": 3,
                "precip": 4
            },
            {
                "date": "20.01",
                "cloud": 63,
                "temp": 1,
                "precip": 19
            },
            {
                "date": "21.01",
                "cloud": 47,
                "temp": 1,
                "precip": 19
            },
            {
                "date": "22.01",
                "cloud": 49,
                "temp": 4,
                "precip": 12
            },
            {
                "date": "23.01",
                "cloud": 45,
                "temp": 2,
                "precip": 15
            },
            {
                "date": "24.01",
                "cloud": 75,
                "temp": -1,
                "precip": 35
            },
            {
                "date": "25.01",
                "cloud": 30,
                "temp": -2,
                "precip": 12
            },
            {
                "date": "26.01",
                "cloud": 63,
                "temp": 0,
                "precip": 27
            },
            {
                "date": "27.01",
                "cloud": 66,
                "temp": -1,
                "precip": 30
            },
            {
                "date": "28.01",
                "cloud": 65,
                "temp": 0,
                "precip": 7
            },
            {
                "date": "29.01",
                "cloud": 70,
                "temp": -1,
                "precip": 11
            },
            {
                "date": "30.01",
                "cloud": 81,
                "temp": -1,
                "precip": 33
            },
            {
                "date": "01.02",
                "cloud": 62,
                "temp": 0,
                "precip": 31
            },
            {
                "date": "02.02",
                "cloud": 59,
                "temp": 1,
                "precip": 22
            },
            {
                "date": "03.02",
                "cloud": 49,
                "temp": 2,
                "precip": 0
            },
            {
                "date": "04.02",
                "cloud": 59,
                "temp": 2,
                "precip": 19
            },
            {
                "date": "05.02",
                "cloud": 39,
                "temp": 2,
                "precip": 13
            },
            {
                "date": "06.02",
                "cloud": 46,
                "temp": 1,
                "precip": 26
            },
            {
                "date": "07.02",
                "cloud": 38,
                "temp": 2,
                "precip": 4
            },
            {
                "date": "08.02",
                "cloud": 55,
                "temp": 3,
                "precip": 12
            },
            {
                "date": "09.02",
                "cloud": 60,
                "temp": 4,
                "precip": 16
            },
            {
                "date": "10.02",
                "cloud": 59,
                "temp": 6,
                "precip": 25
            },
            {
                "date": "11.02",
                "cloud": 59,
                "temp": 4,
                "precip": 11
            },
            {
                "date": "12.02",
                "cloud": 67,
                "temp": 5,
                "precip": 35
            },
            {
                "date": "13.02",
                "cloud": 34,
                "temp": 6,
                "precip": 0
            },
            {
                "date": "14.02",
                "cloud": 34,
                "temp": 7,
                "precip": 4
            },
            {
                "date": "15.02",
                "cloud": 49,
                "temp": 6,
                "precip": 26
            },
            {
                "date": "16.02",
                "cloud": 57,
                "temp": 2,
                "precip": 22
            },
            {
                "date": "17.02",
                "cloud": 63,
                "temp": 2,
                "precip": 7
            },
            {
                "date": "18.02",
                "cloud": 70,
                "temp": 1,
                "precip": 41
            },
            {
                "date": "19.02",
                "cloud": 53,
                "temp": 3,
                "precip": 33
            },
            {
                "date": "21.02",
                "cloud": 62,
                "temp": 6,
                "precip": 30
            },
            {
                "date": "22.02",
                "cloud": 54,
                "temp": 4,
                "precip": 0
            },
            {
                "date": "23.02",
                "cloud": 51,
                "temp": 4,
                "precip": 15
            },
            {
                "date": "24.02",
                "cloud": 51,
                "temp": 4,
                "precip": 8
            },
            {
                "date": "25.02",
                "cloud": 50,
                "temp": 4,
                "precip": 15
            },
            {
                "date": "26.02",
                "cloud": 64,
                "temp": 5,
                "precip": 8
            },
            {
                "date": "27.02",
                "cloud": 44,
                "temp": 5,
                "precip": 15
            },
            {
                "date": "01.03",
                "cloud": 65,
                "temp": 7,
                "precip": 12
            },
            {
                "date": "02.03",
                "cloud": 68,
                "temp": 6,
                "precip": 22
            },
            {
                "date": "03.03",
                "cloud": 63,
                "temp": 5,
                "precip": 37
            },
            {
                "date": "04.03",
                "cloud": 50,
                "temp": 7,
                "precip": 0
            },
            {
                "date": "05.03",
                "cloud": 54,
                "temp": 8,
                "precip": 26
            },
            {
                "date": "06.03",
                "cloud": 50,
                "temp": 8,
                "precip": 11
            },
            {
                "date": "07.03",
                "cloud": 52,
                "temp": 8,
                "precip": 12
            },
            {
                "date": "08.03",
                "cloud": 51,
                "temp": 9,
                "precip": 19
            },
            {
                "date": "09.03",
                "cloud": 71,
                "temp": 6,
                "precip": 30
            },
            {
                "date": "10.03",
                "cloud": 70,
                "temp": 6,
                "precip": 15
            },
            {
                "date": "11.03",
                "cloud": 44,
                "temp": 7,
                "precip": 15
            },
            {
                "date": "12.03",
                "cloud": 71,
                "temp": 8,
                "precip": 37
            },
            {
                "date": "13.03",
                "cloud": 50,
                "temp": 10,
                "precip": 7
            },
            {
                "date": "14.03",
                "cloud": 43,
                "temp": 11,
                "precip": 22
            },
            {
                "date": "15.03",
                "cloud": 51,
                "temp": 11,
                "precip": 7
            },
            {
                "date": "16.03",
                "cloud": 69,
                "temp": 8,
                "precip": 22
            },
            {
                "date": "17.03",
                "cloud": 62,
                "temp": 6,
                "precip": 19
            },
            {
                "date": "18.03",
                "cloud": 66,
                "temp": 8,
                "precip": 26
            },
            {
                "date": "19.03",
                "cloud": 60,
                "temp": 9,
                "precip": 12
            },
            {
                "date": "20.03",
                "cloud": 55,
                "temp": 9,
                "precip": 23
            },
            {
                "date": "21.03",
                "cloud": 47,
                "temp": 11,
                "precip": 15
            },
            {
                "date": "22.03",
                "cloud": 47,
                "temp": 12,
                "precip": 7
            },
            {
                "date": "23.03",
                "cloud": 45,
                "temp": 12,
                "precip": 8
            },
            {
                "date": "24.03",
                "cloud": 50,
                "temp": 13,
                "precip": 15
            },
            {
                "date": "25.03",
                "cloud": 32,
                "temp": 12,
                "precip": 0
            },
            {
                "date": "26.03",
                "cloud": 50,
                "temp": 11,
                "precip": 10
            },
            {
                "date": "30.10",
                "cloud": 36,
                "temp": 13,
                "precip": 0
            },
            {
                "date": "01.11",
                "cloud": 50,
                "temp": 13,
                "precip": 4
            },
            {
                "date": "02.11",
                "cloud": 53,
                "temp": 11,
                "precip": 29
            },
            {
                "date": "03.11",
                "cloud": 55,
                "temp": 10,
                "precip": 13
            },
            {
                "date": "04.11",
                "cloud": 60,
                "temp": 10,
                "precip": 17
            },
            {
                "date": "05.11",
                "cloud": 58,
                "temp": 11,
                "precip": 17
            },
            {
                "date": "06.11",
                "cloud": 39,
                "temp": 12,
                "precip": 8
            },
            {
                "date": "07.11",
                "cloud": 50,
                "temp": 9,
                "precip": 25
            },
            {
                "date": "08.11",
                "cloud": 28,
                "temp": 10,
                "precip": 14
            },
            {
                "date": "09.11",
                "cloud": 25,
                "temp": 12,
                "precip": 5
            },
            {
                "date": "10.11",
                "cloud": 45,
                "temp": 13,
                "precip": 21
            },
            {
                "date": "11.11",
                "cloud": 34,
                "temp": 11,
                "precip": 9
            },
            {
                "date": "12.11",
                "cloud": 42,
                "temp": 10,
                "precip": 4
            },
            {
                "date": "13.11",
                "cloud": 50,
                "temp": 11,
                "precip": 14
            },
            {
                "date": "14.11",
                "cloud": 54,
                "temp": 10,
                "precip": 9
            },
            {
                "date": "15.11",
                "cloud": 54,
                "temp": 9,
                "precip": 4
            },
            {
                "date": "16.11",
                "cloud": 58,
                "temp": 10,
                "precip": 12
            },
            {
                "date": "17.11",
                "cloud": 58,
                "temp": 9,
                "precip": 15
            },
            {
                "date": "18.11",
                "cloud": 68,
                "temp": 7,
                "precip": 12
            },
            {
                "date": "19.11",
                "cloud": 43,
                "temp": 7,
                "precip": 4
            },
            {
                "date": "20.11",
                "cloud": 48,
                "temp": 7,
                "precip": 4
            },
            {
                "date": "21.11",
                "cloud": 62,
                "temp": 6,
                "precip": 0
            },
            {
                "date": "22.11",
                "cloud": 46,
                "temp": 7,
                "precip": 4
            },
            {
                "date": "23.11",
                "cloud": 29,
                "temp": 7,
                "precip": 15
            },
            {
                "date": "24.11",
                "cloud": 36,
                "temp": 7,
                "precip": 7
            },
            {
                "date": "25.11",
                "cloud": 42,
                "temp": 8,
                "precip": 4
            },
            {
                "date": "26.11",
                "cloud": 55,
                "temp": 8,
                "precip": 22
            },
            {
                "date": "27.11",
                "cloud": 78,
                "temp": 7,
                "precip": 35
            },
            {
                "date": "28.11",
                "cloud": 57,
                "temp": 7,
                "precip": 0
            },
            {
                "date": "29.11",
                "cloud": 68,
                "temp": 7,
                "precip": 20
            },
            {
                "date": "01.12",
                "cloud": 72,
                "temp": 8,
                "precip": 22
            },
            {
                "date": "02.12",
                "cloud": 68,
                "temp": 5,
                "precip": 17
            },
            {
                "date": "03.12",
                "cloud": 43,
                "temp": 5,
                "precip": 21
            },
            {
                "date": "04.12",
                "cloud": 24,
                "temp": 7,
                "precip": 0
            },
            {
                "date": "05.12",
                "cloud": 28,
                "temp": 10,
                "precip": 4
            },
            {
                "date": "06.12",
                "cloud": 37,
                "temp": 8,
                "precip": 4
            },
            {
                "date": "07.12",
                "cloud": 76,
                "temp": 6,
                "precip": 22
            },
            {
                "date": "08.12",
                "cloud": 56,
                "temp": 7,
                "precip": 7
            },
            {
                "date": "09.12",
                "cloud": 50,
                "temp": 6,
                "precip": 11
            },
            {
                "date": "10.12",
                "cloud": 50,
                "temp": 5,
                "precip": 15
            },
            {
                "date": "11.12",
                "cloud": 53,
                "temp": 4,
                "precip": 27
            },
            {
                "date": "12.12",
                "cloud": 79,
                "temp": 4,
                "precip": 30
            },
            {
                "date": "13.12",
                "cloud": 75,
                "temp": 3,
                "precip": 19
            },
            {
                "date": "14.12",
                "cloud": 74,
                "temp": 3,
                "precip": 35
            },
            {
                "date": "15.12",
                "cloud": 59,
                "temp": 3,
                "precip": 11
            },
            {
                "date": "16.12",
                "cloud": 47,
                "temp": 2,
                "precip": 4
            },
            {
                "date": "17.12",
                "cloud": 39,
                "temp": 3,
                "precip": 8
            },
            {
                "date": "18.12",
                "cloud": 50,
                "temp": 4,
                "precip": 12
            },
            {
                "date": "19.12",
                "cloud": 66,
                "temp": 5,
                "precip": 15
            },
            {
                "date": "20.12",
                "cloud": 63,
                "temp": 4,
                "precip": 11
            },
            {
                "date": "21.12",
                "cloud": 70,
                "temp": 5,
                "precip": 31
            },
            {
                "date": "22.12",
                "cloud": 53,
                "temp": 4,
                "precip": 8
            },
            {
                "date": "23.12",
                "cloud": 62,
                "temp": 4,
                "precip": 15
            },
            {
                "date": "24.12",
                "cloud": 65,
                "temp": 5,
                "precip": 19
            },
            {
                "date": "25.12",
                "cloud": 58,
                "temp": 6,
                "precip": 11
            },
            {
                "date": "26.12",
                "cloud": 57,
                "temp": 5,
                "precip": 15
            },
            {
                "date": "27.12",
                "cloud": 58,
                "temp": 5,
                "precip": 4
            },
            {
                "date": "28.12",
                "cloud": 62,
                "temp": 5,
                "precip": 8
            },
            {
                "date": "29.12",
                "cloud": 86,
                "temp": 3,
                "precip": 30
            },
            {
                "date": "30.12",
                "cloud": 61,
                "temp": 0,
                "precip": 0
            },
            {
                "date": "20.02",
                "cloud": 48,
                "temp": 6,
                "precip": 17
            },
            {
                "date": "29.10",
                "cloud": 24,
                "temp": 13,
                "precip": 0
            },
            {
                "date": "28.02",
                "cloud": 65,
                "temp": 8,
                "precip": 50
            },
            {
                "date": "27.03",
                "cloud": 44,
                "temp": 10,
                "precip": 22
            },
            {
                "date": "28.03",
                "cloud": 62,
                "temp": 9,
                "precip": 6
            },
            {
                "date": "29.03",
                "cloud": 68,
                "temp": 8,
                "precip": 7
            },
            {
                "date": "30.03",
                "cloud": 59,
                "temp": 11,
                "precip": 13
            },
            {
                "date": "27.10",
                "cloud": 17,
                "temp": 11,
                "precip": 0
            },
            {
                "date": "28.10",
                "cloud": 22,
                "temp": 12,
                "precip": 0
            },
            {
                "date": "26.10",
                "cloud": 33,
                "temp": 6,
                "precip": 0
            },
            {
                "date": "01.04",
                "cloud": 39,
                "temp": 14,
                "precip": 0
            },
            {
                "date": "02.04",
                "cloud": 50,
                "temp": 10,
                "precip": 0
            },
            {
                "date": "03.04",
                "cloud": 26,
                "temp": 10,
                "precip": 33
            },
            {
                "date": "04.04",
                "cloud": 29,
                "temp": 14,
                "precip": 11
            },
            {
                "date": "05.04",
                "cloud": 74,
                "temp": 14,
                "precip": 22
            },
            {
                "date": "06.04",
                "cloud": 52,
                "temp": 14,
                "precip": 33
            },
            {
                "date": "07.04",
                "cloud": 59,
                "temp": 15,
                "precip": 11
            },
            {
                "date": "08.04",
                "cloud": 58,
                "temp": 17,
                "precip": 17
            },
            {
                "date": "09.04",
                "cloud": 50,
                "temp": 16,
                "precip": 17
            },
            {
                "date": "10.04",
                "cloud": 58,
                "temp": 13,
                "precip": 33
            },
            {
                "date": "11.04",
                "cloud": 60,
                "temp": 12,
                "precip": 33
            },
            {
                "date": "12.04",
                "cloud": 83,
                "temp": 10,
                "precip": 17
            },
            {
                "date": "13.04",
                "cloud": 38,
                "temp": 16,
                "precip": 0
            },
            {
                "date": "14.04",
                "cloud": 17,
                "temp": 21,
                "precip": 0
            },
            {
                "date": "15.04",
                "cloud": 47,
                "temp": 19,
                "precip": 0
            },
            {
                "date": "16.04",
                "cloud": 63,
                "temp": 16,
                "precip": 17
            },
            {
                "date": "17.04",
                "cloud": 30,
                "temp": 17,
                "precip": 0
            },
            {
                "date": "18.04",
                "cloud": 12,
                "temp": 19,
                "precip": 0
            },
            {
                "date": "19.04",
                "cloud": 47,
                "temp": 18,
                "precip": 17
            },
            {
                "date": "20.04",
                "cloud": 63,
                "temp": 13,
                "precip": 33
            },
            {
                "date": "21.04",
                "cloud": 47,
                "temp": 17,
                "precip": 0
            },
            {
                "date": "22.04",
                "cloud": 55,
                "temp": 14,
                "precip": 17
            },
            {
                "date": "23.04",
                "cloud": 62,
                "temp": 15,
                "precip": 0
            },
            {
                "date": "24.04",
                "cloud": 47,
                "temp": 18,
                "precip": 0
            },
            {
                "date": "25.04",
                "cloud": 4,
                "temp": 22,
                "precip": 0
            },
            {
                "date": "26.04",
                "cloud": 8,
                "temp": 24,
                "precip": 0
            },
            {
                "date": "27.04",
                "cloud": 18,
                "temp": 23,
                "precip": 0
            },
            {
                "date": "28.04",
                "cloud": 22,
                "temp": 25,
                "precip": 0
            },
            {
                "date": "29.04",
                "cloud": 67,
                "temp": 21,
                "precip": 50
            },
            {
                "date": "01.05",
                "cloud": 47,
                "temp": 23,
                "precip": 0
            },
            {
                "date": "02.05",
                "cloud": 38,
                "temp": 24,
                "precip": 0
            },
            {
                "date": "03.05",
                "cloud": 28,
                "temp": 25,
                "precip": 0
            },
            {
                "date": "04.05",
                "cloud": 35,
                "temp": 25,
                "precip": 17
            },
            {
                "date": "05.05",
                "cloud": 40,
                "temp": 23,
                "precip": 50
            },
            {
                "date": "06.05",
                "cloud": 52,
                "temp": 20,
                "precip": 33
            },
            {
                "date": "07.05",
                "cloud": 62,
                "temp": 19,
                "precip": 0
            },
            {
                "date": "08.05",
                "cloud": 46,
                "temp": 18,
                "precip": 0
            },
            {
                "date": "09.05",
                "cloud": 55,
                "temp": 20,
                "precip": 0
            },
            {
                "date": "10.05",
                "cloud": 37,
                "temp": 21,
                "precip": 0
            },
            {
                "date": "11.05",
                "cloud": 27,
                "temp": 24,
                "precip": 0
            },
            {
                "date": "12.05",
                "cloud": 62,
                "temp": 22,
                "precip": 33
            },
            {
                "date": "13.05",
                "cloud": 60,
                "temp": 22,
                "precip": 17
            },
            {
                "date": "14.05",
                "cloud": 80,
                "temp": 21,
                "precip": 17
            },
            {
                "date": "15.05",
                "cloud": 68,
                "temp": 20,
                "precip": 33
            },
            {
                "date": "16.05",
                "cloud": 42,
                "temp": 24,
                "precip": 0
            },
            {
                "date": "17.05",
                "cloud": 38,
                "temp": 24,
                "precip": 17
            },
            {
                "date": "18.05",
                "cloud": 25,
                "temp": 26,
                "precip": 0
            },
            {
                "date": "19.05",
                "cloud": 8,
                "temp": 28,
                "precip": 0
            },
            {
                "date": "20.05",
                "cloud": 55,
                "temp": 24,
                "precip": 0
            },
            {
                "date": "21.05",
                "cloud": 62,
                "temp": 24,
                "precip": 0
            },
            {
                "date": "22.05",
                "cloud": 67,
                "temp": 24,
                "precip": 0
            },
            {
                "date": "23.05",
                "cloud": 62,
                "temp": 24,
                "precip": 33
            },
            {
                "date": "24.05",
                "cloud": 53,
                "temp": 24,
                "precip": 0
            },
            {
                "date": "25.05",
                "cloud": 43,
                "temp": 24,
                "precip": 0
            },
            {
                "date": "26.05",
                "cloud": 93,
                "temp": 17,
                "precip": 83
            },
            {
                "date": "27.05",
                "cloud": 52,
                "temp": 21,
                "precip": 0
            },
            {
                "date": "28.05",
                "cloud": 27,
                "temp": 24,
                "precip": 0
            },
            {
                "date": "29.05",
                "cloud": 60,
                "temp": 23,
                "precip": 17
            },
            {
                "date": "30.05",
                "cloud": 48,
                "temp": 24,
                "precip": 17
            },
            {
                "date": "01.06",
                "cloud": 50,
                "temp": 25,
                "precip": 17
            },
            {
                "date": "02.06",
                "cloud": 38,
                "temp": 25,
                "precip": 0
            },
            {
                "date": "03.06",
                "cloud": 43,
                "temp": 27,
                "precip": 0
            },
            {
                "date": "04.06",
                "cloud": 23,
                "temp": 28,
                "precip": 0
            },
            {
                "date": "05.06",
                "cloud": 57,
                "temp": 25,
                "precip": 0
            },
            {
                "date": "06.06",
                "cloud": 40,
                "temp": 28,
                "precip": 0
            },
            {
                "date": "07.06",
                "cloud": 44,
                "temp": 27,
                "precip": 0
            },
            {
                "date": "08.06",
                "cloud": 37,
                "temp": 27,
                "precip": 0
            },
            {
                "date": "09.06",
                "cloud": 18,
                "temp": 28,
                "precip": 0
            },
            {
                "date": "10.06",
                "cloud": 20,
                "temp": 29,
                "precip": 0
            },
            {
                "date": "11.06",
                "cloud": 37,
                "temp": 28,
                "precip": 0
            },
            {
                "date": "12.06",
                "cloud": 23,
                "temp": 28,
                "precip": 17
            },
            {
                "date": "13.06",
                "cloud": 25,
                "temp": 29,
                "precip": 0
            },
            {
                "date": "14.06",
                "cloud": 42,
                "temp": 31,
                "precip": 17
            },
            {
                "date": "15.06",
                "cloud": 43,
                "temp": 28,
                "precip": 0
            },
            {
                "date": "16.06",
                "cloud": 47,
                "temp": 26,
                "precip": 17
            },
            {
                "date": "17.06",
                "cloud": 45,
                "temp": 27,
                "precip": 0
            },
            {
                "date": "18.06",
                "cloud": 50,
                "temp": 29,
                "precip": 0
            },
            {
                "date": "19.06",
                "cloud": 53,
                "temp": 28,
                "precip": 17
            },
            {
                "date": "20.06",
                "cloud": 22,
                "temp": 28,
                "precip": 0
            },
            {
                "date": "21.06",
                "cloud": 36,
                "temp": 27,
                "precip": 0
            },
            {
                "date": "22.06",
                "cloud": 55,
                "temp": 29,
                "precip": 0
            },
            {
                "date": "23.06",
                "cloud": 27,
                "temp": 30,
                "precip": 0
            },
            {
                "date": "24.06",
                "cloud": 32,
                "temp": 31,
                "precip": 0
            },
            {
                "date": "25.06",
                "cloud": 15,
                "temp": 32,
                "precip": 0
            },
            {
                "date": "26.06",
                "cloud": 43,
                "temp": 29,
                "precip": 0
            },
            {
                "date": "27.06",
                "cloud": 62,
                "temp": 25,
                "precip": 0
            },
            {
                "date": "28.06",
                "cloud": 60,
                "temp": 22,
                "precip": 17
            },
            {
                "date": "29.06",
                "cloud": 77,
                "temp": 25,
                "precip": 0
            },
            {
                "date": "30.06",
                "cloud": 60,
                "temp": 25,
                "precip": 0
            },
            {
                "date": "01.07",
                "cloud": 58,
                "temp": 24,
                "precip": 0
            },
            {
                "date": "02.07",
                "cloud": 40,
                "temp": 27,
                "precip": 17
            },
            {
                "date": "03.07",
                "cloud": 48,
                "temp": 28,
                "precip": 0
            },
            {
                "date": "04.07",
                "cloud": 50,
                "temp": 26,
                "precip": 0
            },
            {
                "date": "05.07",
                "cloud": 63,
                "temp": 26,
                "precip": 0
            },
            {
                "date": "06.07",
                "cloud": 72,
                "temp": 25,
                "precip": 33
            },
            {
                "date": "07.07",
                "cloud": 25,
                "temp": 30,
                "precip": 0
            },
            {
                "date": "08.07",
                "cloud": 30,
                "temp": 30,
                "precip": 0
            },
            {
                "date": "09.07",
                "cloud": 37,
                "temp": 30,
                "precip": 17
            },
            {
                "date": "10.07",
                "cloud": 45,
                "temp": 30,
                "precip": 0
            },
            {
                "date": "11.07",
                "cloud": 40,
                "temp": 29,
                "precip": 17
            },
            {
                "date": "12.07",
                "cloud": 58,
                "temp": 30,
                "precip": 17
            },
            {
                "date": "13.07",
                "cloud": 8,
                "temp": 31,
                "precip": 0
            },
            {
                "date": "14.07",
                "cloud": 28,
                "temp": 31,
                "precip": 0
            },
            {
                "date": "15.07",
                "cloud": 28,
                "temp": 32,
                "precip": 0
            },
            {
                "date": "16.07",
                "cloud": 37,
                "temp": 32,
                "precip": 0
            },
            {
                "date": "17.07",
                "cloud": 25,
                "temp": 31,
                "precip": 0
            },
            {
                "date": "18.07",
                "cloud": 42,
                "temp": 31,
                "precip": 0
            },
            {
                "date": "19.07",
                "cloud": 42,
                "temp": 30,
                "precip": 0
            },
            {
                "date": "20.07",
                "cloud": 10,
                "temp": 32,
                "precip": 0
            },
            {
                "date": "21.07",
                "cloud": 5,
                "temp": 34,
                "precip": 0
            },
            {
                "date": "22.07",
                "cloud": 20,
                "temp": 33,
                "precip": 0
            },
            {
                "date": "23.07",
                "cloud": 33,
                "temp": 31,
                "precip": 0
            },
            {
                "date": "24.07",
                "cloud": 28,
                "temp": 33,
                "precip": 0
            },
            {
                "date": "25.07",
                "cloud": 10,
                "temp": 34,
                "precip": 0
            },
            {
                "date": "26.07",
                "cloud": 5,
                "temp": 35,
                "precip": 0
            },
            {
                "date": "27.07",
                "cloud": 10,
                "temp": 36,
                "precip": 0
            },
            {
                "date": "28.07",
                "cloud": 15,
                "temp": 34,
                "precip": 0
            },
            {
                "date": "29.07",
                "cloud": 20,
                "temp": 33,
                "precip": 0
            },
            {
                "date": "30.07",
                "cloud": 25,
                "temp": 32,
                "precip": 0
            },
            {
                "date": "01.08",
                "cloud": 33,
                "temp": 30,
                "precip": 17
            },
            {
                "date": "02.08",
                "cloud": 27,
                "temp": 32,
                "precip": 0
            },
            {
                "date": "03.08",
                "cloud": 45,
                "temp": 31,
                "precip": 0
            },
            {
                "date": "04.08",
                "cloud": 28,
                "temp": 30,
                "precip": 0
            },
            {
                "date": "05.08",
                "cloud": 32,
                "temp": 29,
                "precip": 0
            },
            {
                "date": "06.08",
                "cloud": 43,
                "temp": 29,
                "precip": 0
            },
            {
                "date": "07.08",
                "cloud": 12,
                "temp": 29,
                "precip": 0
            },
            {
                "date": "08.08",
                "cloud": 18,
                "temp": 32,
                "precip": 0
            },
            {
                "date": "09.08",
                "cloud": 30,
                "temp": 31,
                "precip": 0
            },
            {
                "date": "10.08",
                "cloud": 25,
                "temp": 29,
                "precip": 0
            },
            {
                "date": "11.08",
                "cloud": 40,
                "temp": 31,
                "precip": 0
            },
            {
                "date": "12.08",
                "cloud": 40,
                "temp": 31,
                "precip": 0
            },
            {
                "date": "13.08",
                "cloud": 28,
                "temp": 29,
                "precip": 0
            },
            {
                "date": "14.08",
                "cloud": 42,
                "temp": 28,
                "precip": 0
            },
            {
                "date": "15.08",
                "cloud": 43,
                "temp": 29,
                "precip": 25
            },
            {
                "date": "16.08",
                "cloud": 53,
                "temp": 27,
                "precip": 17
            },
            {
                "date": "17.08",
                "cloud": 48,
                "temp": 26,
                "precip": 20
            },
            {
                "date": "18.08",
                "cloud": 73,
                "temp": 25,
                "precip": 17
            },
            {
                "date": "19.08",
                "cloud": 53,
                "temp": 26,
                "precip": 0
            },
            {
                "date": "20.08",
                "cloud": 58,
                "temp": 27,
                "precip": 17
            },
            {
                "date": "21.08",
                "cloud": 52,
                "temp": 27,
                "precip": 17
            },
            {
                "date": "22.08",
                "cloud": 20,
                "temp": 24,
                "precip": 0
            },
            {
                "date": "23.08",
                "cloud": 27,
                "temp": 27,
                "precip": 0
            },
            {
                "date": "24.08",
                "cloud": 13,
                "temp": 30,
                "precip": 0
            },
            {
                "date": "25.08",
                "cloud": 25,
                "temp": 29,
                "precip": 0
            },
            {
                "date": "26.08",
                "cloud": 8,
                "temp": 30,
                "precip": 0
            },
            {
                "date": "27.08",
                "cloud": 0,
                "temp": 32,
                "precip": 0
            },
            {
                "date": "28.08",
                "cloud": 18,
                "temp": 28,
                "precip": 0
            },
            {
                "date": "29.08",
                "cloud": 38,
                "temp": 26,
                "precip": 17
            },
            {
                "date": "30.08",
                "cloud": 32,
                "temp": 27,
                "precip": 0
            },
            {
                "date": "01.09",
                "cloud": 52,
                "temp": 26,
                "precip": 0
            },
            {
                "date": "02.09",
                "cloud": 23,
                "temp": 27,
                "precip": 0
            },
            {
                "date": "03.09",
                "cloud": 10,
                "temp": 27,
                "precip": 0
            },
            {
                "date": "04.09",
                "cloud": 23,
                "temp": 26,
                "precip": 0
            },
            {
                "date": "05.09",
                "cloud": 33,
                "temp": 26,
                "precip": 0
            },
            {
                "date": "06.09",
                "cloud": 25,
                "temp": 25,
                "precip": 0
            },
            {
                "date": "07.09",
                "cloud": 39,
                "temp": 26,
                "precip": 0
            },
            {
                "date": "08.09",
                "cloud": 47,
                "temp": 25,
                "precip": 0
            },
            {
                "date": "09.09",
                "cloud": 58,
                "temp": 21,
                "precip": 33
            },
            {
                "date": "10.09",
                "cloud": 26,
                "temp": 23,
                "precip": 0
            },
            {
                "date": "11.09",
                "cloud": 40,
                "temp": 22,
                "precip": 0
            },
            {
                "date": "12.09",
                "cloud": 23,
                "temp": 24,
                "precip": 0
            },
            {
                "date": "13.09",
                "cloud": 22,
                "temp": 27,
                "precip": 0
            },
            {
                "date": "14.09",
                "cloud": 33,
                "temp": 26,
                "precip": 17
            },
            {
                "date": "15.09",
                "cloud": 18,
                "temp": 28,
                "precip": 0
            },
            {
                "date": "16.09",
                "cloud": 13,
                "temp": 29,
                "precip": 0
            },
            {
                "date": "17.09",
                "cloud": 30,
                "temp": 27,
                "precip": 0
            },
            {
                "date": "18.09",
                "cloud": 10,
                "temp": 26,
                "precip": 0
            },
            {
                "date": "19.09",
                "cloud": 0,
                "temp": 26,
                "precip": 0
            },
            {
                "date": "20.09",
                "cloud": 18,
                "temp": 26,
                "precip": 0
            },
            {
                "date": "21.09",
                "cloud": 23,
                "temp": 26,
                "precip": 17
            },
            {
                "date": "22.09",
                "cloud": 52,
                "temp": 24,
                "precip": 40
            },
            {
                "date": "23.09",
                "cloud": 40,
                "temp": 25,
                "precip": 0
            },
            {
                "date": "24.09",
                "cloud": 33,
                "temp": 25,
                "precip": 0
            },
            {
                "date": "25.09",
                "cloud": 17,
                "temp": 23,
                "precip": 0
            },
            {
                "date": "26.09",
                "cloud": 10,
                "temp": 24,
                "precip": 0
            },
            {
                "date": "27.09",
                "cloud": 12,
                "temp": 24,
                "precip": 0
            },
            {
                "date": "28.09",
                "cloud": 2,
                "temp": 25,
                "precip": 0
            },
            {
                "date": "29.09",
                "cloud": 28,
                "temp": 22,
                "precip": 17
            },
            {
                "date": "01.10",
                "cloud": 27,
                "temp": 22,
                "precip": 0
            },
            {
                "date": "02.10",
                "cloud": 18,
                "temp": 22,
                "precip": 0
            },
            {
                "date": "03.10",
                "cloud": 52,
                "temp": 19,
                "precip": 0
            },
            {
                "date": "04.10",
                "cloud": 62,
                "temp": 19,
                "precip": 17
            },
            {
                "date": "05.10",
                "cloud": 63,
                "temp": 20,
                "precip": 17
            },
            {
                "date": "06.10",
                "cloud": 27,
                "temp": 23,
                "precip": 0
            },
            {
                "date": "07.10",
                "cloud": 5,
                "temp": 24,
                "precip": 0
            },
            {
                "date": "08.10",
                "cloud": 28,
                "temp": 23,
                "precip": 40
            },
            {
                "date": "09.10",
                "cloud": 30,
                "temp": 24,
                "precip": 0
            },
            {
                "date": "10.10",
                "cloud": 47,
                "temp": 24,
                "precip": 0
            },
            {
                "date": "11.10",
                "cloud": 20,
                "temp": 27,
                "precip": 0
            },
            {
                "date": "12.10",
                "cloud": 67,
                "temp": 22,
                "precip": 33
            },
            {
                "date": "13.10",
                "cloud": 80,
                "temp": 18,
                "precip": 0
            },
            {
                "date": "14.10",
                "cloud": 97,
                "temp": 11,
                "precip": 67
            },
            {
                "date": "15.10",
                "cloud": 37,
                "temp": 12,
                "precip": 0
            },
            {
                "date": "16.10",
                "cloud": 100,
                "temp": 9,
                "precip": 100
            },
            {
                "date": "17.10",
                "cloud": 100,
                "temp": 9,
                "precip": 100
            },
            {
                "date": "18.10",
                "cloud": 60,
                "temp": 15,
                "precip": 0
            },
            {
                "date": "19.10",
                "cloud": 53,
                "temp": 13,
                "precip": 0
            },
            {
                "date": "20.10",
                "cloud": 23,
                "temp": 15,
                "precip": 0
            },
            {
                "date": "21.10",
                "cloud": 100,
                "temp": 11,
                "precip": 0
            },
            {
                "date": "23.10",
                "cloud": 55,
                "temp": 17,
                "precip": 0
            },
            {
                "date": "24.10",
                "cloud": 92,
                "temp": 7,
                "precip": 0
            },
            {
                "date": "25.10",
                "cloud": 53,
                "temp": 4,
                "precip": 0
            }
        ];
        return {
            all: function () {
                return common_weather;
            },
            get: function (day) {
                var date;
                var parts;
                for (var i=0; i<common_weather.length; i++){
                    parts = common_weather[i].date+'.2015';
                    parts = parts.split('.');
                    date = new Date(parts[2],parts[1]-1,parts[0]);
                    if ((day<date) &&((date-day)<=86400000)){
                        return common_weather[i];
                    }
                }
                return 0;
            }
        };
    });
